Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x613 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xcb293): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m33 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv8-m.main+dsp+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x12ae78): ../AZURE_RTOS/App/app_azure_rtos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xb9e14): F:/Grutter_Services_LLC/Repositories/STMCube-ThreadX/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x10544e): signed char
 <1><30>: Abbrev Number: 2 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 1
    <32>   DW_AT_encoding    : 8	(unsigned char)
    <33>   DW_AT_name        : (indirect string, offset: 0x98919): unsigned char
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 2
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x7f4a9): short int
 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 2
    <40>   DW_AT_encoding    : 7	(unsigned)
    <41>   DW_AT_name        : (indirect string, offset: 0x57342): short unsigned int
 <1><45>: Abbrev Number: 2 (DW_TAG_base_type)
    <46>   DW_AT_byte_size   : 4
    <47>   DW_AT_encoding    : 5	(signed)
    <48>   DW_AT_name        : (indirect string, offset: 0x104682): long int
 <1><4c>: Abbrev Number: 2 (DW_TAG_base_type)
    <4d>   DW_AT_byte_size   : 4
    <4e>   DW_AT_encoding    : 7	(unsigned)
    <4f>   DW_AT_name        : (indirect string, offset: 0xc04a5): long unsigned int
 <1><53>: Abbrev Number: 2 (DW_TAG_base_type)
    <54>   DW_AT_byte_size   : 8
    <55>   DW_AT_encoding    : 5	(signed)
    <56>   DW_AT_name        : (indirect string, offset: 0x8f52): long long int
 <1><5a>: Abbrev Number: 2 (DW_TAG_base_type)
    <5b>   DW_AT_byte_size   : 8
    <5c>   DW_AT_encoding    : 7	(unsigned)
    <5d>   DW_AT_name        : (indirect string, offset: 0x9afef): long long unsigned int
 <1><61>: Abbrev Number: 3 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 4
    <63>   DW_AT_encoding    : 5	(signed)
    <64>   DW_AT_name        : int
 <1><68>: Abbrev Number: 2 (DW_TAG_base_type)
    <69>   DW_AT_byte_size   : 4
    <6a>   DW_AT_encoding    : 7	(unsigned)
    <6b>   DW_AT_name        : (indirect string, offset: 0x8cccb): unsigned int
 <1><6f>: Abbrev Number: 2 (DW_TAG_base_type)
    <70>   DW_AT_byte_size   : 8
    <71>   DW_AT_encoding    : 4	(float)
    <72>   DW_AT_name        : (indirect string, offset: 0xadcc3): long double
 <1><76>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <77>   DW_AT_byte_size   : 4
 <1><78>: Abbrev Number: 2 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 1
    <7a>   DW_AT_encoding    : 8	(unsigned char)
    <7b>   DW_AT_name        : (indirect string, offset: 0x105455): char
 <1><7f>: Abbrev Number: 2 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 4
    <81>   DW_AT_encoding    : 4	(float)
    <82>   DW_AT_name        : (indirect string, offset: 0xfb025): float
 <1><86>: Abbrev Number: 2 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 8
    <88>   DW_AT_encoding    : 4	(float)
    <89>   DW_AT_name        : (indirect string, offset: 0xadcc8): double
 <1><8d>: Abbrev Number: 5 (DW_TAG_typedef)
    <8e>   DW_AT_name        : (indirect string, offset: 0xa15c8): CHAR
    <92>   DW_AT_decl_file   : 2
    <93>   DW_AT_decl_line   : 118
    <94>   DW_AT_decl_column : 49
    <95>   DW_AT_type        : <0x78>
 <1><99>: Abbrev Number: 5 (DW_TAG_typedef)
    <9a>   DW_AT_name        : (indirect string, offset: 0xa15c7): UCHAR
    <9e>   DW_AT_decl_file   : 2
    <9f>   DW_AT_decl_line   : 119
    <a0>   DW_AT_decl_column : 49
    <a1>   DW_AT_type        : <0x30>
 <1><a5>: Abbrev Number: 5 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0xd36fa): UINT
    <aa>   DW_AT_decl_file   : 2
    <ab>   DW_AT_decl_line   : 121
    <ac>   DW_AT_decl_column : 49
    <ad>   DW_AT_type        : <0x68>
 <1><b1>: Abbrev Number: 5 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x11a729): ULONG
    <b6>   DW_AT_decl_file   : 2
    <b7>   DW_AT_decl_line   : 123
    <b8>   DW_AT_decl_column : 49
    <b9>   DW_AT_type        : <0x4c>
 <1><bd>: Abbrev Number: 6 (DW_TAG_structure_type)
    <be>   DW_AT_name        : (indirect string, offset: 0x4adb3): TX_TIMER_INTERNAL_STRUCT
    <c2>   DW_AT_byte_size   : 28
    <c3>   DW_AT_decl_file   : 3
    <c4>   DW_AT_decl_line   : 370
    <c6>   DW_AT_decl_column : 16
    <c7>   DW_AT_sibling     : <0x12e>
 <2><cb>: Abbrev Number: 7 (DW_TAG_member)
    <cc>   DW_AT_name        : (indirect string, offset: 0xda098): tx_timer_internal_remaining_ticks
    <d0>   DW_AT_decl_file   : 3
    <d1>   DW_AT_decl_line   : 374
    <d3>   DW_AT_decl_column : 25
    <d4>   DW_AT_type        : <0xb1>
    <d8>   DW_AT_data_member_location: 0
 <2><d9>: Abbrev Number: 7 (DW_TAG_member)
    <da>   DW_AT_name        : (indirect string, offset: 0xff1bc): tx_timer_internal_re_initialize_ticks
    <de>   DW_AT_decl_file   : 3
    <df>   DW_AT_decl_line   : 375
    <e1>   DW_AT_decl_column : 25
    <e2>   DW_AT_type        : <0xb1>
    <e6>   DW_AT_data_member_location: 4
 <2><e7>: Abbrev Number: 7 (DW_TAG_member)
    <e8>   DW_AT_name        : (indirect string, offset: 0x3df1a): tx_timer_internal_timeout_function
    <ec>   DW_AT_decl_file   : 3
    <ed>   DW_AT_decl_line   : 378
    <ef>   DW_AT_decl_column : 27
    <f0>   DW_AT_type        : <0x139>
    <f4>   DW_AT_data_member_location: 8
 <2><f5>: Abbrev Number: 7 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0x1168ae): tx_timer_internal_timeout_param
    <fa>   DW_AT_decl_file   : 3
    <fb>   DW_AT_decl_line   : 379
    <fd>   DW_AT_decl_column : 25
    <fe>   DW_AT_type        : <0xb1>
    <102>   DW_AT_data_member_location: 12
 <2><103>: Abbrev Number: 7 (DW_TAG_member)
    <104>   DW_AT_name        : (indirect string, offset: 0x7f94e): tx_timer_internal_active_next
    <108>   DW_AT_decl_file   : 3
    <109>   DW_AT_decl_line   : 385
    <10b>   DW_AT_decl_column : 26
    <10c>   DW_AT_type        : <0x13f>
    <110>   DW_AT_data_member_location: 16
 <2><111>: Abbrev Number: 7 (DW_TAG_member)
    <112>   DW_AT_name        : (indirect string, offset: 0xc9b01): tx_timer_internal_active_previous
    <116>   DW_AT_decl_file   : 3
    <117>   DW_AT_decl_line   : 386
    <119>   DW_AT_decl_column : 26
    <11a>   DW_AT_type        : <0x13f>
    <11e>   DW_AT_data_member_location: 20
 <2><11f>: Abbrev Number: 7 (DW_TAG_member)
    <120>   DW_AT_name        : (indirect string, offset: 0xaeb13): tx_timer_internal_list_head
    <124>   DW_AT_decl_file   : 3
    <125>   DW_AT_decl_line   : 390
    <127>   DW_AT_decl_column : 27
    <128>   DW_AT_type        : <0x145>
    <12c>   DW_AT_data_member_location: 24
 <2><12d>: Abbrev Number: 0
 <1><12e>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <12f>   DW_AT_prototyped  : 1
    <12f>   DW_AT_sibling     : <0x139>
 <2><133>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <134>   DW_AT_type        : <0xb1>
 <2><138>: Abbrev Number: 0
 <1><139>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <13a>   DW_AT_byte_size   : 4
    <13b>   DW_AT_type        : <0x12e>
 <1><13f>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <140>   DW_AT_byte_size   : 4
    <141>   DW_AT_type        : <0xbd>
 <1><145>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <146>   DW_AT_byte_size   : 4
    <147>   DW_AT_type        : <0x13f>
 <1><14b>: Abbrev Number: 11 (DW_TAG_typedef)
    <14c>   DW_AT_name        : (indirect string, offset: 0x102320): TX_TIMER_INTERNAL
    <150>   DW_AT_decl_file   : 3
    <151>   DW_AT_decl_line   : 395
    <153>   DW_AT_decl_column : 3
    <154>   DW_AT_type        : <0xbd>
 <1><158>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <159>   DW_AT_byte_size   : 4
    <15a>   DW_AT_type        : <0x8d>
 <1><15e>: Abbrev Number: 6 (DW_TAG_structure_type)
    <15f>   DW_AT_name        : (indirect string, offset: 0xfc71f): TX_THREAD_STRUCT
    <163>   DW_AT_byte_size   : 176
    <164>   DW_AT_decl_file   : 3
    <165>   DW_AT_decl_line   : 454
    <167>   DW_AT_decl_column : 16
    <168>   DW_AT_sibling     : <0x381>
 <2><16c>: Abbrev Number: 7 (DW_TAG_member)
    <16d>   DW_AT_name        : (indirect string, offset: 0xd4dcb): tx_thread_id
    <171>   DW_AT_decl_file   : 3
    <172>   DW_AT_decl_line   : 461
    <174>   DW_AT_decl_column : 25
    <175>   DW_AT_type        : <0xb1>
    <179>   DW_AT_data_member_location: 0
 <2><17a>: Abbrev Number: 7 (DW_TAG_member)
    <17b>   DW_AT_name        : (indirect string, offset: 0x1253ba): tx_thread_run_count
    <17f>   DW_AT_decl_file   : 3
    <180>   DW_AT_decl_line   : 462
    <182>   DW_AT_decl_column : 25
    <183>   DW_AT_type        : <0xb1>
    <187>   DW_AT_data_member_location: 4
 <2><188>: Abbrev Number: 7 (DW_TAG_member)
    <189>   DW_AT_name        : (indirect string, offset: 0x8257e): tx_thread_stack_ptr
    <18d>   DW_AT_decl_file   : 3
    <18e>   DW_AT_decl_line   : 463
    <190>   DW_AT_decl_column : 26
    <191>   DW_AT_type        : <0x76>
    <195>   DW_AT_data_member_location: 8
 <2><196>: Abbrev Number: 7 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0xf682): tx_thread_stack_start
    <19b>   DW_AT_decl_file   : 3
    <19c>   DW_AT_decl_line   : 464
    <19e>   DW_AT_decl_column : 26
    <19f>   DW_AT_type        : <0x76>
    <1a3>   DW_AT_data_member_location: 12
 <2><1a4>: Abbrev Number: 7 (DW_TAG_member)
    <1a5>   DW_AT_name        : (indirect string, offset: 0xc5faa): tx_thread_stack_end
    <1a9>   DW_AT_decl_file   : 3
    <1aa>   DW_AT_decl_line   : 465
    <1ac>   DW_AT_decl_column : 26
    <1ad>   DW_AT_type        : <0x76>
    <1b1>   DW_AT_data_member_location: 16
 <2><1b2>: Abbrev Number: 7 (DW_TAG_member)
    <1b3>   DW_AT_name        : (indirect string, offset: 0x2b109): tx_thread_stack_size
    <1b7>   DW_AT_decl_file   : 3
    <1b8>   DW_AT_decl_line   : 466
    <1ba>   DW_AT_decl_column : 25
    <1bb>   DW_AT_type        : <0xb1>
    <1bf>   DW_AT_data_member_location: 20
 <2><1c0>: Abbrev Number: 7 (DW_TAG_member)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x134b6c): tx_thread_time_slice
    <1c5>   DW_AT_decl_file   : 3
    <1c6>   DW_AT_decl_line   : 467
    <1c8>   DW_AT_decl_column : 25
    <1c9>   DW_AT_type        : <0xb1>
    <1cd>   DW_AT_data_member_location: 24
 <2><1ce>: Abbrev Number: 7 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0xed488): tx_thread_new_time_slice
    <1d3>   DW_AT_decl_file   : 3
    <1d4>   DW_AT_decl_line   : 468
    <1d6>   DW_AT_decl_column : 25
    <1d7>   DW_AT_type        : <0xb1>
    <1db>   DW_AT_data_member_location: 28
 <2><1dc>: Abbrev Number: 7 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x10673a): tx_thread_ready_next
    <1e1>   DW_AT_decl_file   : 3
    <1e2>   DW_AT_decl_line   : 472
    <1e4>   DW_AT_decl_column : 26
    <1e5>   DW_AT_type        : <0x381>
    <1e9>   DW_AT_data_member_location: 32
 <2><1ea>: Abbrev Number: 7 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x22464): tx_thread_ready_previous
    <1ef>   DW_AT_decl_file   : 3
    <1f0>   DW_AT_decl_line   : 473
    <1f2>   DW_AT_decl_column : 26
    <1f3>   DW_AT_type        : <0x381>
    <1f7>   DW_AT_data_member_location: 36
 <2><1f8>: Abbrev Number: 7 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x1aae9): tx_thread_name
    <1fd>   DW_AT_decl_file   : 3
    <1fe>   DW_AT_decl_line   : 481
    <200>   DW_AT_decl_column : 26
    <201>   DW_AT_type        : <0x158>
    <205>   DW_AT_data_member_location: 40
 <2><206>: Abbrev Number: 7 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0x44c67): tx_thread_priority
    <20b>   DW_AT_decl_file   : 3
    <20c>   DW_AT_decl_line   : 482
    <20e>   DW_AT_decl_column : 25
    <20f>   DW_AT_type        : <0xa5>
    <213>   DW_AT_data_member_location: 44
 <2><214>: Abbrev Number: 7 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0xf0e2c): tx_thread_state
    <219>   DW_AT_decl_file   : 3
    <21a>   DW_AT_decl_line   : 483
    <21c>   DW_AT_decl_column : 25
    <21d>   DW_AT_type        : <0xa5>
    <221>   DW_AT_data_member_location: 48
 <2><222>: Abbrev Number: 7 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0xfaee8): tx_thread_delayed_suspend
    <227>   DW_AT_decl_file   : 3
    <228>   DW_AT_decl_line   : 484
    <22a>   DW_AT_decl_column : 25
    <22b>   DW_AT_type        : <0xa5>
    <22f>   DW_AT_data_member_location: 52
 <2><230>: Abbrev Number: 7 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0xeb126): tx_thread_suspending
    <235>   DW_AT_decl_file   : 3
    <236>   DW_AT_decl_line   : 485
    <238>   DW_AT_decl_column : 25
    <239>   DW_AT_type        : <0xa5>
    <23d>   DW_AT_data_member_location: 56
 <2><23e>: Abbrev Number: 7 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0xdee63): tx_thread_preempt_threshold
    <243>   DW_AT_decl_file   : 3
    <244>   DW_AT_decl_line   : 486
    <246>   DW_AT_decl_column : 25
    <247>   DW_AT_type        : <0xa5>
    <24b>   DW_AT_data_member_location: 60
 <2><24c>: Abbrev Number: 7 (DW_TAG_member)
    <24d>   DW_AT_name        : (indirect string, offset: 0xa5ec): tx_thread_schedule_hook
    <251>   DW_AT_decl_file   : 3
    <252>   DW_AT_decl_line   : 491
    <254>   DW_AT_decl_column : 27
    <255>   DW_AT_type        : <0x397>
    <259>   DW_AT_data_member_location: 64
 <2><25a>: Abbrev Number: 7 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0xfa029): tx_thread_entry
    <25f>   DW_AT_decl_file   : 3
    <260>   DW_AT_decl_line   : 499
    <262>   DW_AT_decl_column : 27
    <263>   DW_AT_type        : <0x139>
    <267>   DW_AT_data_member_location: 68
 <2><268>: Abbrev Number: 7 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x4d8d9): tx_thread_entry_parameter
    <26d>   DW_AT_decl_file   : 3
    <26e>   DW_AT_decl_line   : 500
    <270>   DW_AT_decl_column : 25
    <271>   DW_AT_type        : <0xb1>
    <275>   DW_AT_data_member_location: 72
 <2><276>: Abbrev Number: 7 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0xc7cf3): tx_thread_timer
    <27b>   DW_AT_decl_file   : 3
    <27c>   DW_AT_decl_line   : 504
    <27e>   DW_AT_decl_column : 25
    <27f>   DW_AT_type        : <0x14b>
    <283>   DW_AT_data_member_location: 76
 <2><284>: Abbrev Number: 7 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0xe402a): tx_thread_suspend_cleanup
    <289>   DW_AT_decl_file   : 3
    <28a>   DW_AT_decl_line   : 510
    <28c>   DW_AT_decl_column : 27
    <28d>   DW_AT_type        : <0x397>
    <291>   DW_AT_data_member_location: 104
 <2><292>: Abbrev Number: 7 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0xc2824): tx_thread_suspend_control_block
    <297>   DW_AT_decl_file   : 3
    <298>   DW_AT_decl_line   : 511
    <29a>   DW_AT_decl_column : 26
    <29b>   DW_AT_type        : <0x76>
    <29f>   DW_AT_data_member_location: 108
 <2><2a0>: Abbrev Number: 7 (DW_TAG_member)
    <2a1>   DW_AT_name        : (indirect string, offset: 0xc3190): tx_thread_suspended_next
    <2a5>   DW_AT_decl_file   : 3
    <2a6>   DW_AT_decl_line   : 513
    <2a8>   DW_AT_decl_column : 26
    <2a9>   DW_AT_type        : <0x381>
    <2ad>   DW_AT_data_member_location: 112
 <2><2ae>: Abbrev Number: 7 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0x6bd8f): tx_thread_suspended_previous
    <2b3>   DW_AT_decl_file   : 3
    <2b4>   DW_AT_decl_line   : 514
    <2b6>   DW_AT_decl_column : 26
    <2b7>   DW_AT_type        : <0x381>
    <2bb>   DW_AT_data_member_location: 116
 <2><2bc>: Abbrev Number: 7 (DW_TAG_member)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x89923): tx_thread_suspend_info
    <2c1>   DW_AT_decl_file   : 3
    <2c2>   DW_AT_decl_line   : 515
    <2c4>   DW_AT_decl_column : 25
    <2c5>   DW_AT_type        : <0xb1>
    <2c9>   DW_AT_data_member_location: 120
 <2><2ca>: Abbrev Number: 7 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x94ed2): tx_thread_additional_suspend_info
    <2cf>   DW_AT_decl_file   : 3
    <2d0>   DW_AT_decl_line   : 516
    <2d2>   DW_AT_decl_column : 26
    <2d3>   DW_AT_type        : <0x76>
    <2d7>   DW_AT_data_member_location: 124
 <2><2d8>: Abbrev Number: 7 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0xd20f6): tx_thread_suspend_option
    <2dd>   DW_AT_decl_file   : 3
    <2de>   DW_AT_decl_line   : 517
    <2e0>   DW_AT_decl_column : 25
    <2e1>   DW_AT_type        : <0xa5>
    <2e5>   DW_AT_data_member_location: 128
 <2><2e6>: Abbrev Number: 7 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x7b919): tx_thread_suspend_status
    <2eb>   DW_AT_decl_file   : 3
    <2ec>   DW_AT_decl_line   : 518
    <2ee>   DW_AT_decl_column : 25
    <2ef>   DW_AT_type        : <0xa5>
    <2f3>   DW_AT_data_member_location: 132
 <2><2f4>: Abbrev Number: 7 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x41cf8): tx_thread_created_next
    <2f9>   DW_AT_decl_file   : 3
    <2fa>   DW_AT_decl_line   : 527
    <2fc>   DW_AT_decl_column : 26
    <2fd>   DW_AT_type        : <0x381>
    <301>   DW_AT_data_member_location: 136
 <2><302>: Abbrev Number: 7 (DW_TAG_member)
    <303>   DW_AT_name        : (indirect string, offset: 0x571e8): tx_thread_created_previous
    <307>   DW_AT_decl_file   : 3
    <308>   DW_AT_decl_line   : 528
    <30a>   DW_AT_decl_column : 26
    <30b>   DW_AT_type        : <0x381>
    <30f>   DW_AT_data_member_location: 140
 <2><310>: Abbrev Number: 7 (DW_TAG_member)
    <311>   DW_AT_name        : (indirect string, offset: 0x373c9): tx_thread_filex_ptr
    <315>   DW_AT_decl_file   : 3
    <316>   DW_AT_decl_line   : 536
    <318>   DW_AT_decl_column : 26
    <319>   DW_AT_type        : <0x76>
    <31d>   DW_AT_data_member_location: 144
 <2><31e>: Abbrev Number: 7 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0x39ca9): tx_thread_user_priority
    <323>   DW_AT_decl_file   : 3
    <324>   DW_AT_decl_line   : 542
    <326>   DW_AT_decl_column : 25
    <327>   DW_AT_type        : <0xa5>
    <32b>   DW_AT_data_member_location: 148
 <2><32c>: Abbrev Number: 7 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x98d10): tx_thread_user_preempt_threshold
    <331>   DW_AT_decl_file   : 3
    <332>   DW_AT_decl_line   : 543
    <334>   DW_AT_decl_column : 25
    <335>   DW_AT_type        : <0xa5>
    <339>   DW_AT_data_member_location: 152
 <2><33a>: Abbrev Number: 7 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x8aab8): tx_thread_inherit_priority
    <33f>   DW_AT_decl_file   : 3
    <340>   DW_AT_decl_line   : 544
    <342>   DW_AT_decl_column : 25
    <343>   DW_AT_type        : <0xa5>
    <347>   DW_AT_data_member_location: 156
 <2><348>: Abbrev Number: 7 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0x97326): tx_thread_owned_mutex_count
    <34d>   DW_AT_decl_file   : 3
    <34e>   DW_AT_decl_line   : 547
    <350>   DW_AT_decl_column : 25
    <351>   DW_AT_type        : <0xa5>
    <355>   DW_AT_data_member_location: 160
 <2><356>: Abbrev Number: 7 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0xe1f0b): tx_thread_owned_mutex_list
    <35b>   DW_AT_decl_file   : 3
    <35c>   DW_AT_decl_line   : 549
    <35e>   DW_AT_decl_column : 26
    <35f>   DW_AT_type        : <0x462>
    <363>   DW_AT_data_member_location: 164
 <2><364>: Abbrev Number: 7 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0xa2d83): tx_thread_stack_highest_ptr
    <369>   DW_AT_decl_file   : 3
    <36a>   DW_AT_decl_line   : 589
    <36c>   DW_AT_decl_column : 26
    <36d>   DW_AT_type        : <0x76>
    <371>   DW_AT_data_member_location: 168
 <2><372>: Abbrev Number: 7 (DW_TAG_member)
    <373>   DW_AT_name        : (indirect string, offset: 0x12c0de): tx_thread_suspension_sequence
    <377>   DW_AT_decl_file   : 3
    <378>   DW_AT_decl_line   : 616
    <37a>   DW_AT_decl_column : 25
    <37b>   DW_AT_type        : <0xb1>
    <37f>   DW_AT_data_member_location: 172
 <2><380>: Abbrev Number: 0
 <1><381>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <382>   DW_AT_byte_size   : 4
    <383>   DW_AT_type        : <0x15e>
 <1><387>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <388>   DW_AT_prototyped  : 1
    <388>   DW_AT_sibling     : <0x397>
 <2><38c>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <38d>   DW_AT_type        : <0x381>
 <2><391>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <392>   DW_AT_type        : <0xb1>
 <2><396>: Abbrev Number: 0
 <1><397>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <398>   DW_AT_byte_size   : 4
    <399>   DW_AT_type        : <0x387>
 <1><39d>: Abbrev Number: 6 (DW_TAG_structure_type)
    <39e>   DW_AT_name        : (indirect string, offset: 0xd5ce6): TX_MUTEX_STRUCT
    <3a2>   DW_AT_byte_size   : 52
    <3a3>   DW_AT_decl_file   : 3
    <3a4>   DW_AT_decl_line   : 872
    <3a6>   DW_AT_decl_column : 16
    <3a7>   DW_AT_sibling     : <0x462>
 <2><3ab>: Abbrev Number: 7 (DW_TAG_member)
    <3ac>   DW_AT_name        : (indirect string, offset: 0xeb36b): tx_mutex_id
    <3b0>   DW_AT_decl_file   : 3
    <3b1>   DW_AT_decl_line   : 876
    <3b3>   DW_AT_decl_column : 25
    <3b4>   DW_AT_type        : <0xb1>
    <3b8>   DW_AT_data_member_location: 0
 <2><3b9>: Abbrev Number: 7 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0xb8b35): tx_mutex_name
    <3be>   DW_AT_decl_file   : 3
    <3bf>   DW_AT_decl_line   : 879
    <3c1>   DW_AT_decl_column : 26
    <3c2>   DW_AT_type        : <0x158>
    <3c6>   DW_AT_data_member_location: 4
 <2><3c7>: Abbrev Number: 7 (DW_TAG_member)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x124aee): tx_mutex_ownership_count
    <3cc>   DW_AT_decl_file   : 3
    <3cd>   DW_AT_decl_line   : 882
    <3cf>   DW_AT_decl_column : 25
    <3d0>   DW_AT_type        : <0xa5>
    <3d4>   DW_AT_data_member_location: 8
 <2><3d5>: Abbrev Number: 7 (DW_TAG_member)
    <3d6>   DW_AT_name        : (indirect string, offset: 0x7f1cf): tx_mutex_owner
    <3da>   DW_AT_decl_file   : 3
    <3db>   DW_AT_decl_line   : 886
    <3dd>   DW_AT_decl_column : 26
    <3de>   DW_AT_type        : <0x553>
    <3e2>   DW_AT_data_member_location: 12
 <2><3e3>: Abbrev Number: 7 (DW_TAG_member)
    <3e4>   DW_AT_name        : (indirect string, offset: 0x4b796): tx_mutex_inherit
    <3e8>   DW_AT_decl_file   : 3
    <3e9>   DW_AT_decl_line   : 890
    <3eb>   DW_AT_decl_column : 25
    <3ec>   DW_AT_type        : <0xa5>
    <3f0>   DW_AT_data_member_location: 16
 <2><3f1>: Abbrev Number: 7 (DW_TAG_member)
    <3f2>   DW_AT_name        : (indirect string, offset: 0xc39a1): tx_mutex_original_priority
    <3f6>   DW_AT_decl_file   : 3
    <3f7>   DW_AT_decl_line   : 893
    <3f9>   DW_AT_decl_column : 25
    <3fa>   DW_AT_type        : <0xa5>
    <3fe>   DW_AT_data_member_location: 20
 <2><3ff>: Abbrev Number: 7 (DW_TAG_member)
    <400>   DW_AT_name        : (indirect string, offset: 0x734ab): tx_mutex_suspension_list
    <404>   DW_AT_decl_file   : 3
    <405>   DW_AT_decl_line   : 898
    <407>   DW_AT_decl_column : 26
    <408>   DW_AT_type        : <0x381>
    <40c>   DW_AT_data_member_location: 24
 <2><40d>: Abbrev Number: 7 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0x6ca7c): tx_mutex_suspended_count
    <412>   DW_AT_decl_file   : 3
    <413>   DW_AT_decl_line   : 899
    <415>   DW_AT_decl_column : 25
    <416>   DW_AT_type        : <0xa5>
    <41a>   DW_AT_data_member_location: 28
 <2><41b>: Abbrev Number: 7 (DW_TAG_member)
    <41c>   DW_AT_name        : (indirect string, offset: 0x103adf): tx_mutex_created_next
    <420>   DW_AT_decl_file   : 3
    <421>   DW_AT_decl_line   : 903
    <423>   DW_AT_decl_column : 26
    <424>   DW_AT_type        : <0x462>
    <428>   DW_AT_data_member_location: 32
 <2><429>: Abbrev Number: 7 (DW_TAG_member)
    <42a>   DW_AT_name        : (indirect string, offset: 0x10ec7c): tx_mutex_created_previous
    <42e>   DW_AT_decl_file   : 3
    <42f>   DW_AT_decl_line   : 904
    <431>   DW_AT_decl_column : 26
    <432>   DW_AT_type        : <0x462>
    <436>   DW_AT_data_member_location: 36
 <2><437>: Abbrev Number: 7 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0xc7db): tx_mutex_highest_priority_waiting
    <43c>   DW_AT_decl_file   : 3
    <43d>   DW_AT_decl_line   : 908
    <43f>   DW_AT_decl_column : 25
    <440>   DW_AT_type        : <0xa5>
    <444>   DW_AT_data_member_location: 40
 <2><445>: Abbrev Number: 7 (DW_TAG_member)
    <446>   DW_AT_name        : (indirect string, offset: 0xb67c9): tx_mutex_owned_next
    <44a>   DW_AT_decl_file   : 3
    <44b>   DW_AT_decl_line   : 912
    <44d>   DW_AT_decl_column : 26
    <44e>   DW_AT_type        : <0x462>
    <452>   DW_AT_data_member_location: 44
 <2><453>: Abbrev Number: 7 (DW_TAG_member)
    <454>   DW_AT_name        : (indirect string, offset: 0x247ee): tx_mutex_owned_previous
    <458>   DW_AT_decl_file   : 3
    <459>   DW_AT_decl_line   : 913
    <45b>   DW_AT_decl_column : 26
    <45c>   DW_AT_type        : <0x462>
    <460>   DW_AT_data_member_location: 48
 <2><461>: Abbrev Number: 0
 <1><462>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <463>   DW_AT_byte_size   : 4
    <464>   DW_AT_type        : <0x39d>
 <1><468>: Abbrev Number: 11 (DW_TAG_typedef)
    <469>   DW_AT_name        : (indirect string, offset: 0xfe48e): TX_THREAD
    <46d>   DW_AT_decl_file   : 3
    <46e>   DW_AT_decl_line   : 624
    <470>   DW_AT_decl_column : 3
    <471>   DW_AT_type        : <0x15e>
 <1><475>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <476>   DW_AT_byte_size   : 4
    <477>   DW_AT_type        : <0x99>
 <1><47b>: Abbrev Number: 6 (DW_TAG_structure_type)
    <47c>   DW_AT_name        : (indirect string, offset: 0x11aa93): TX_BYTE_POOL_STRUCT
    <480>   DW_AT_byte_size   : 52
    <481>   DW_AT_decl_file   : 3
    <482>   DW_AT_decl_line   : 707
    <484>   DW_AT_decl_column : 16
    <485>   DW_AT_sibling     : <0x540>
 <2><489>: Abbrev Number: 7 (DW_TAG_member)
    <48a>   DW_AT_name        : (indirect string, offset: 0x8f628): tx_byte_pool_id
    <48e>   DW_AT_decl_file   : 3
    <48f>   DW_AT_decl_line   : 711
    <491>   DW_AT_decl_column : 25
    <492>   DW_AT_type        : <0xb1>
    <496>   DW_AT_data_member_location: 0
 <2><497>: Abbrev Number: 7 (DW_TAG_member)
    <498>   DW_AT_name        : (indirect string, offset: 0x40c59): tx_byte_pool_name
    <49c>   DW_AT_decl_file   : 3
    <49d>   DW_AT_decl_line   : 714
    <49f>   DW_AT_decl_column : 26
    <4a0>   DW_AT_type        : <0x158>
    <4a4>   DW_AT_data_member_location: 4
 <2><4a5>: Abbrev Number: 7 (DW_TAG_member)
    <4a6>   DW_AT_name        : (indirect string, offset: 0x2ca98): tx_byte_pool_available
    <4aa>   DW_AT_decl_file   : 3
    <4ab>   DW_AT_decl_line   : 717
    <4ad>   DW_AT_decl_column : 25
    <4ae>   DW_AT_type        : <0xb1>
    <4b2>   DW_AT_data_member_location: 8
 <2><4b3>: Abbrev Number: 7 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x1261bb): tx_byte_pool_fragments
    <4b8>   DW_AT_decl_file   : 3
    <4b9>   DW_AT_decl_line   : 720
    <4bb>   DW_AT_decl_column : 25
    <4bc>   DW_AT_type        : <0xa5>
    <4c0>   DW_AT_data_member_location: 12
 <2><4c1>: Abbrev Number: 7 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0xb0c0d): tx_byte_pool_list
    <4c6>   DW_AT_decl_file   : 3
    <4c7>   DW_AT_decl_line   : 723
    <4c9>   DW_AT_decl_column : 26
    <4ca>   DW_AT_type        : <0x475>
    <4ce>   DW_AT_data_member_location: 16
 <2><4cf>: Abbrev Number: 7 (DW_TAG_member)
    <4d0>   DW_AT_name        : (indirect string, offset: 0xd34bd): tx_byte_pool_search
    <4d4>   DW_AT_decl_file   : 3
    <4d5>   DW_AT_decl_line   : 727
    <4d7>   DW_AT_decl_column : 26
    <4d8>   DW_AT_type        : <0x475>
    <4dc>   DW_AT_data_member_location: 20
 <2><4dd>: Abbrev Number: 7 (DW_TAG_member)
    <4de>   DW_AT_name        : (indirect string, offset: 0x138d4): tx_byte_pool_start
    <4e2>   DW_AT_decl_file   : 3
    <4e3>   DW_AT_decl_line   : 730
    <4e5>   DW_AT_decl_column : 26
    <4e6>   DW_AT_type        : <0x475>
    <4ea>   DW_AT_data_member_location: 24
 <2><4eb>: Abbrev Number: 7 (DW_TAG_member)
    <4ec>   DW_AT_name        : (indirect string, offset: 0xdb259): tx_byte_pool_size
    <4f0>   DW_AT_decl_file   : 3
    <4f1>   DW_AT_decl_line   : 733
    <4f3>   DW_AT_decl_column : 25
    <4f4>   DW_AT_type        : <0xb1>
    <4f8>   DW_AT_data_member_location: 28
 <2><4f9>: Abbrev Number: 7 (DW_TAG_member)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x98fee): tx_byte_pool_owner
    <4fe>   DW_AT_decl_file   : 3
    <4ff>   DW_AT_decl_line   : 739
    <501>   DW_AT_decl_column : 26
    <502>   DW_AT_type        : <0x381>
    <506>   DW_AT_data_member_location: 32
 <2><507>: Abbrev Number: 7 (DW_TAG_member)
    <508>   DW_AT_name        : (indirect string, offset: 0x9b1a3): tx_byte_pool_suspension_list
    <50c>   DW_AT_decl_file   : 3
    <50d>   DW_AT_decl_line   : 744
    <50f>   DW_AT_decl_column : 26
    <510>   DW_AT_type        : <0x381>
    <514>   DW_AT_data_member_location: 36
 <2><515>: Abbrev Number: 7 (DW_TAG_member)
    <516>   DW_AT_name        : (indirect string, offset: 0xc6bf2): tx_byte_pool_suspended_count
    <51a>   DW_AT_decl_file   : 3
    <51b>   DW_AT_decl_line   : 745
    <51d>   DW_AT_decl_column : 25
    <51e>   DW_AT_type        : <0xa5>
    <522>   DW_AT_data_member_location: 40
 <2><523>: Abbrev Number: 7 (DW_TAG_member)
    <524>   DW_AT_name        : (indirect string, offset: 0xe8bae): tx_byte_pool_created_next
    <528>   DW_AT_decl_file   : 3
    <529>   DW_AT_decl_line   : 749
    <52b>   DW_AT_decl_column : 26
    <52c>   DW_AT_type        : <0x540>
    <530>   DW_AT_data_member_location: 44
 <2><531>: Abbrev Number: 7 (DW_TAG_member)
    <532>   DW_AT_name        : (indirect string, offset: 0x291c7): tx_byte_pool_created_previous
    <536>   DW_AT_decl_file   : 3
    <537>   DW_AT_decl_line   : 750
    <539>   DW_AT_decl_column : 26
    <53a>   DW_AT_type        : <0x540>
    <53e>   DW_AT_data_member_location: 48
 <2><53f>: Abbrev Number: 0
 <1><540>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <541>   DW_AT_byte_size   : 4
    <542>   DW_AT_type        : <0x47b>
 <1><546>: Abbrev Number: 11 (DW_TAG_typedef)
    <547>   DW_AT_name        : (indirect string, offset: 0xa3f20): TX_BYTE_POOL
    <54b>   DW_AT_decl_file   : 3
    <54c>   DW_AT_decl_line   : 781
    <54e>   DW_AT_decl_column : 3
    <54f>   DW_AT_type        : <0x47b>
 <1><553>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <554>   DW_AT_byte_size   : 4
    <555>   DW_AT_type        : <0x468>
 <1><559>: Abbrev Number: 12 (DW_TAG_array_type)
    <55a>   DW_AT_type        : <0x99>
    <55e>   DW_AT_sibling     : <0x56a>
 <2><562>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <563>   DW_AT_type        : <0x68>
    <567>   DW_AT_upper_bound : 1023
 <2><569>: Abbrev Number: 0
 <1><56a>: Abbrev Number: 14 (DW_TAG_variable)
    <56b>   DW_AT_name        : (indirect string, offset: 0xb2de2): tx_byte_pool_buffer
    <56f>   DW_AT_decl_file   : 1
    <570>   DW_AT_decl_line   : 55
    <571>   DW_AT_decl_column : 28
    <572>   DW_AT_type        : <0x559>
    <576>   DW_AT_alignment   : 4
    <577>   DW_AT_location    : 5 byte block: 3 2c 0 0 20 	(DW_OP_addr: 2000002c)
 <1><57d>: Abbrev Number: 15 (DW_TAG_variable)
    <57e>   DW_AT_name        : (indirect string, offset: 0xcffe3): tx_app_byte_pool
    <582>   DW_AT_decl_file   : 1
    <583>   DW_AT_decl_line   : 56
    <584>   DW_AT_decl_column : 21
    <585>   DW_AT_type        : <0x546>
    <589>   DW_AT_location    : 5 byte block: 3 2c 4 0 20 	(DW_OP_addr: 2000042c)
 <1><58f>: Abbrev Number: 16 (DW_TAG_subprogram)
    <590>   DW_AT_external    : 1
    <590>   DW_AT_name        : (indirect string, offset: 0x69761): App_ThreadX_Init
    <594>   DW_AT_decl_file   : 4
    <595>   DW_AT_decl_line   : 64
    <596>   DW_AT_decl_column : 6
    <597>   DW_AT_prototyped  : 1
    <597>   DW_AT_type        : <0xa5>
    <59b>   DW_AT_declaration : 1
    <59b>   DW_AT_sibling     : <0x5a5>
 <2><59f>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5a0>   DW_AT_type        : <0x76>
 <2><5a4>: Abbrev Number: 0
 <1><5a5>: Abbrev Number: 17 (DW_TAG_subprogram)
    <5a6>   DW_AT_external    : 1
    <5a6>   DW_AT_name        : (indirect string, offset: 0x889e): _txe_byte_pool_create
    <5aa>   DW_AT_decl_file   : 3
    <5ab>   DW_AT_decl_line   : 1520
    <5ad>   DW_AT_decl_column : 13
    <5ae>   DW_AT_prototyped  : 1
    <5ae>   DW_AT_type        : <0xa5>
    <5b2>   DW_AT_declaration : 1
    <5b2>   DW_AT_sibling     : <0x5d0>
 <2><5b6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5b7>   DW_AT_type        : <0x5d0>
 <2><5bb>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5bc>   DW_AT_type        : <0x158>
 <2><5c0>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5c1>   DW_AT_type        : <0x76>
 <2><5c5>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5c6>   DW_AT_type        : <0xb1>
 <2><5ca>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5cb>   DW_AT_type        : <0xa5>
 <2><5cf>: Abbrev Number: 0
 <1><5d0>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <5d1>   DW_AT_byte_size   : 4
    <5d2>   DW_AT_type        : <0x546>
 <1><5d6>: Abbrev Number: 18 (DW_TAG_subprogram)
    <5d7>   DW_AT_external    : 1
    <5d7>   DW_AT_name        : (indirect string, offset: 0xcf866): tx_application_define
    <5db>   DW_AT_decl_file   : 1
    <5dc>   DW_AT_decl_line   : 70
    <5dd>   DW_AT_decl_column : 6
    <5de>   DW_AT_prototyped  : 1
    <5de>   DW_AT_low_pc      : 0x80004b4
    <5e2>   DW_AT_high_pc     : 0x4c
    <5e6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5e8>   DW_AT_GNU_all_tail_call_sites: 1
 <2><5e8>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <5e9>   DW_AT_name        : (indirect string, offset: 0xa1d36): first_unused_memory
    <5ed>   DW_AT_decl_file   : 1
    <5ee>   DW_AT_decl_line   : 70
    <5ef>   DW_AT_decl_column : 34
    <5f0>   DW_AT_type        : <0x76>
    <5f4>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><5f7>: Abbrev Number: 15 (DW_TAG_variable)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x7b92b): status
    <5fc>   DW_AT_decl_file   : 1
    <5fd>   DW_AT_decl_line   : 76
    <5fe>   DW_AT_decl_column : 8
    <5ff>   DW_AT_type        : <0xa5>
    <603>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><606>: Abbrev Number: 15 (DW_TAG_variable)
    <607>   DW_AT_name        : (indirect string, offset: 0x7277e): memory_ptr
    <60b>   DW_AT_decl_file   : 1
    <60c>   DW_AT_decl_line   : 77
    <60d>   DW_AT_decl_column : 9
    <60e>   DW_AT_type        : <0x76>
    <612>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><615>: Abbrev Number: 0
 <1><616>: Abbrev Number: 0
  Compilation Unit @ offset 0x617:
   Length:        0xd8 (32-bit)
   Version:       4
   Abbrev Offset: 0x11d
   Pointer Size:  4
 <0><622>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <623>   DW_AT_producer    : (indirect string, offset: 0xcb293): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m33 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv8-m.main+dsp+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <627>   DW_AT_language    : 12	(ANSI C99)
    <628>   DW_AT_name        : (indirect string, offset: 0x12f262): ../Core/Src/app_threadx.c
    <62c>   DW_AT_comp_dir    : (indirect string, offset: 0xb9e14): F:/Grutter_Services_LLC/Repositories/STMCube-ThreadX/Debug
    <630>   DW_AT_ranges      : 0x10
    <634>   DW_AT_low_pc      : 0x0
    <638>   DW_AT_stmt_list   : 0x8d2
    <63c>   DW_AT_GNU_macros  : 0x2faef
 <1><640>: Abbrev Number: 2 (DW_TAG_base_type)
    <641>   DW_AT_byte_size   : 4
    <642>   DW_AT_encoding    : 7	(unsigned)
    <643>   DW_AT_name        : (indirect string, offset: 0x8cccb): unsigned int
 <1><647>: Abbrev Number: 3 (DW_TAG_base_type)
    <648>   DW_AT_byte_size   : 4
    <649>   DW_AT_encoding    : 5	(signed)
    <64a>   DW_AT_name        : int
 <1><64e>: Abbrev Number: 2 (DW_TAG_base_type)
    <64f>   DW_AT_byte_size   : 8
    <650>   DW_AT_encoding    : 5	(signed)
    <651>   DW_AT_name        : (indirect string, offset: 0x8f52): long long int
 <1><655>: Abbrev Number: 2 (DW_TAG_base_type)
    <656>   DW_AT_byte_size   : 8
    <657>   DW_AT_encoding    : 4	(float)
    <658>   DW_AT_name        : (indirect string, offset: 0xadcc3): long double
 <1><65c>: Abbrev Number: 2 (DW_TAG_base_type)
    <65d>   DW_AT_byte_size   : 1
    <65e>   DW_AT_encoding    : 6	(signed char)
    <65f>   DW_AT_name        : (indirect string, offset: 0x10544e): signed char
 <1><663>: Abbrev Number: 2 (DW_TAG_base_type)
    <664>   DW_AT_byte_size   : 1
    <665>   DW_AT_encoding    : 8	(unsigned char)
    <666>   DW_AT_name        : (indirect string, offset: 0x98919): unsigned char
 <1><66a>: Abbrev Number: 2 (DW_TAG_base_type)
    <66b>   DW_AT_byte_size   : 2
    <66c>   DW_AT_encoding    : 5	(signed)
    <66d>   DW_AT_name        : (indirect string, offset: 0x7f4a9): short int
 <1><671>: Abbrev Number: 2 (DW_TAG_base_type)
    <672>   DW_AT_byte_size   : 2
    <673>   DW_AT_encoding    : 7	(unsigned)
    <674>   DW_AT_name        : (indirect string, offset: 0x57342): short unsigned int
 <1><678>: Abbrev Number: 2 (DW_TAG_base_type)
    <679>   DW_AT_byte_size   : 4
    <67a>   DW_AT_encoding    : 5	(signed)
    <67b>   DW_AT_name        : (indirect string, offset: 0x104682): long int
 <1><67f>: Abbrev Number: 2 (DW_TAG_base_type)
    <680>   DW_AT_byte_size   : 4
    <681>   DW_AT_encoding    : 7	(unsigned)
    <682>   DW_AT_name        : (indirect string, offset: 0xc04a5): long unsigned int
 <1><686>: Abbrev Number: 2 (DW_TAG_base_type)
    <687>   DW_AT_byte_size   : 8
    <688>   DW_AT_encoding    : 7	(unsigned)
    <689>   DW_AT_name        : (indirect string, offset: 0x9afef): long long unsigned int
 <1><68d>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <68e>   DW_AT_byte_size   : 4
 <1><68f>: Abbrev Number: 2 (DW_TAG_base_type)
    <690>   DW_AT_byte_size   : 1
    <691>   DW_AT_encoding    : 8	(unsigned char)
    <692>   DW_AT_name        : (indirect string, offset: 0x105455): char
 <1><696>: Abbrev Number: 5 (DW_TAG_typedef)
    <697>   DW_AT_name        : (indirect string, offset: 0xd36fa): UINT
    <69b>   DW_AT_decl_file   : 2
    <69c>   DW_AT_decl_line   : 121
    <69d>   DW_AT_decl_column : 49
    <69e>   DW_AT_type        : <0x640>
 <1><6a2>: Abbrev Number: 6 (DW_TAG_subprogram)
    <6a3>   DW_AT_external    : 1
    <6a3>   DW_AT_name        : (indirect string, offset: 0x7496b): _tx_initialize_kernel_enter
    <6a7>   DW_AT_decl_file   : 3
    <6a8>   DW_AT_decl_line   : 1589
    <6aa>   DW_AT_decl_column : 13
    <6ab>   DW_AT_prototyped  : 1
    <6ab>   DW_AT_declaration : 1
 <1><6ab>: Abbrev Number: 7 (DW_TAG_subprogram)
    <6ac>   DW_AT_external    : 1
    <6ac>   DW_AT_name        : (indirect string, offset: 0x12f27c): MX_ThreadX_Init
    <6b0>   DW_AT_decl_file   : 1
    <6b1>   DW_AT_decl_line   : 76
    <6b2>   DW_AT_decl_column : 6
    <6b3>   DW_AT_prototyped  : 1
    <6b3>   DW_AT_low_pc      : 0x800051a
    <6b7>   DW_AT_high_pc     : 0xc
    <6bb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6bd>   DW_AT_GNU_all_tail_call_sites: 1
 <1><6bd>: Abbrev Number: 8 (DW_TAG_subprogram)
    <6be>   DW_AT_external    : 1
    <6be>   DW_AT_name        : (indirect string, offset: 0x69761): App_ThreadX_Init
    <6c2>   DW_AT_decl_file   : 1
    <6c3>   DW_AT_decl_line   : 59
    <6c4>   DW_AT_decl_column : 6
    <6c5>   DW_AT_prototyped  : 1
    <6c5>   DW_AT_type        : <0x696>
    <6c9>   DW_AT_low_pc      : 0x8000500
    <6cd>   DW_AT_high_pc     : 0x1a
    <6d1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6d3>   DW_AT_GNU_all_call_sites: 1
 <2><6d3>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x7277e): memory_ptr
    <6d8>   DW_AT_decl_file   : 1
    <6d9>   DW_AT_decl_line   : 59
    <6da>   DW_AT_decl_column : 29
    <6db>   DW_AT_type        : <0x68d>
    <6df>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><6e2>: Abbrev Number: 10 (DW_TAG_variable)
    <6e3>   DW_AT_name        : ret
    <6e7>   DW_AT_decl_file   : 1
    <6e8>   DW_AT_decl_line   : 61
    <6e9>   DW_AT_decl_column : 8
    <6ea>   DW_AT_type        : <0x696>
    <6ee>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><6f1>: Abbrev Number: 0
 <1><6f2>: Abbrev Number: 0
  Compilation Unit @ offset 0x6f3:
   Length:        0x3fc (32-bit)
   Version:       4
   Abbrev Offset: 0x1cb
   Pointer Size:  4
 <0><6fe>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <6ff>   DW_AT_producer    : (indirect string, offset: 0xcb293): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m33 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv8-m.main+dsp+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <703>   DW_AT_language    : 12	(ANSI C99)
    <704>   DW_AT_name        : (indirect string, offset: 0x12f392): ../Core/Src/main.c
    <708>   DW_AT_comp_dir    : (indirect string, offset: 0xb9e14): F:/Grutter_Services_LLC/Repositories/STMCube-ThreadX/Debug
    <70c>   DW_AT_ranges      : 0x28
    <710>   DW_AT_low_pc      : 0x0
    <714>   DW_AT_stmt_list   : 0xe72
    <718>   DW_AT_GNU_macros  : 0x2fc52
 <1><71c>: Abbrev Number: 2 (DW_TAG_base_type)
    <71d>   DW_AT_byte_size   : 4
    <71e>   DW_AT_encoding    : 7	(unsigned)
    <71f>   DW_AT_name        : (indirect string, offset: 0x8cccb): unsigned int
 <1><723>: Abbrev Number: 3 (DW_TAG_base_type)
    <724>   DW_AT_byte_size   : 4
    <725>   DW_AT_encoding    : 5	(signed)
    <726>   DW_AT_name        : int
 <1><72a>: Abbrev Number: 2 (DW_TAG_base_type)
    <72b>   DW_AT_byte_size   : 8
    <72c>   DW_AT_encoding    : 5	(signed)
    <72d>   DW_AT_name        : (indirect string, offset: 0x8f52): long long int
 <1><731>: Abbrev Number: 2 (DW_TAG_base_type)
    <732>   DW_AT_byte_size   : 8
    <733>   DW_AT_encoding    : 4	(float)
    <734>   DW_AT_name        : (indirect string, offset: 0xadcc3): long double
 <1><738>: Abbrev Number: 2 (DW_TAG_base_type)
    <739>   DW_AT_byte_size   : 1
    <73a>   DW_AT_encoding    : 6	(signed char)
    <73b>   DW_AT_name        : (indirect string, offset: 0x10544e): signed char
 <1><73f>: Abbrev Number: 2 (DW_TAG_base_type)
    <740>   DW_AT_byte_size   : 1
    <741>   DW_AT_encoding    : 8	(unsigned char)
    <742>   DW_AT_name        : (indirect string, offset: 0x98919): unsigned char
 <1><746>: Abbrev Number: 2 (DW_TAG_base_type)
    <747>   DW_AT_byte_size   : 2
    <748>   DW_AT_encoding    : 5	(signed)
    <749>   DW_AT_name        : (indirect string, offset: 0x7f4a9): short int
 <1><74d>: Abbrev Number: 2 (DW_TAG_base_type)
    <74e>   DW_AT_byte_size   : 2
    <74f>   DW_AT_encoding    : 7	(unsigned)
    <750>   DW_AT_name        : (indirect string, offset: 0x57342): short unsigned int
 <1><754>: Abbrev Number: 2 (DW_TAG_base_type)
    <755>   DW_AT_byte_size   : 4
    <756>   DW_AT_encoding    : 5	(signed)
    <757>   DW_AT_name        : (indirect string, offset: 0x104682): long int
 <1><75b>: Abbrev Number: 4 (DW_TAG_typedef)
    <75c>   DW_AT_name        : (indirect string, offset: 0x12f2dc): __uint32_t
    <760>   DW_AT_decl_file   : 3
    <761>   DW_AT_decl_line   : 79
    <762>   DW_AT_decl_column : 25
    <763>   DW_AT_type        : <0x767>
 <1><767>: Abbrev Number: 2 (DW_TAG_base_type)
    <768>   DW_AT_byte_size   : 4
    <769>   DW_AT_encoding    : 7	(unsigned)
    <76a>   DW_AT_name        : (indirect string, offset: 0xc04a5): long unsigned int
 <1><76e>: Abbrev Number: 2 (DW_TAG_base_type)
    <76f>   DW_AT_byte_size   : 8
    <770>   DW_AT_encoding    : 7	(unsigned)
    <771>   DW_AT_name        : (indirect string, offset: 0x9afef): long long unsigned int
 <1><775>: Abbrev Number: 2 (DW_TAG_base_type)
    <776>   DW_AT_byte_size   : 1
    <777>   DW_AT_encoding    : 8	(unsigned char)
    <778>   DW_AT_name        : (indirect string, offset: 0x105455): char
 <1><77c>: Abbrev Number: 4 (DW_TAG_typedef)
    <77d>   DW_AT_name        : (indirect string, offset: 0x12f2de): uint32_t
    <781>   DW_AT_decl_file   : 4
    <782>   DW_AT_decl_line   : 48
    <783>   DW_AT_decl_column : 20
    <784>   DW_AT_type        : <0x75b>
 <1><788>: Abbrev Number: 2 (DW_TAG_base_type)
    <789>   DW_AT_byte_size   : 4
    <78a>   DW_AT_encoding    : 4	(float)
    <78b>   DW_AT_name        : (indirect string, offset: 0xfb025): float
 <1><78f>: Abbrev Number: 2 (DW_TAG_base_type)
    <790>   DW_AT_byte_size   : 8
    <791>   DW_AT_encoding    : 4	(float)
    <792>   DW_AT_name        : (indirect string, offset: 0xadcc8): double
 <1><796>: Abbrev Number: 5 (DW_TAG_enumeration_type)
    <797>   DW_AT_encoding    : 7	(unsigned)
    <798>   DW_AT_byte_size   : 1
    <799>   DW_AT_type        : <0x73f>
    <79d>   DW_AT_decl_file   : 5
    <79e>   DW_AT_decl_line   : 44
    <79f>   DW_AT_decl_column : 1
    <7a0>   DW_AT_sibling     : <0x7bd>
 <2><7a4>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x12f4b8): HAL_OK
    <7a9>   DW_AT_const_value : 0
 <2><7aa>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x12f374): HAL_ERROR
    <7af>   DW_AT_const_value : 1
 <2><7b0>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x12f2e7): HAL_BUSY
    <7b5>   DW_AT_const_value : 2
 <2><7b6>: Abbrev Number: 6 (DW_TAG_enumerator)
    <7b7>   DW_AT_name        : (indirect string, offset: 0x12f32f): HAL_TIMEOUT
    <7bb>   DW_AT_const_value : 3
 <2><7bc>: Abbrev Number: 0
 <1><7bd>: Abbrev Number: 4 (DW_TAG_typedef)
    <7be>   DW_AT_name        : (indirect string, offset: 0x12f4bf): HAL_StatusTypeDef
    <7c2>   DW_AT_decl_file   : 5
    <7c3>   DW_AT_decl_line   : 49
    <7c4>   DW_AT_decl_column : 3
    <7c5>   DW_AT_type        : <0x796>
 <1><7c9>: Abbrev Number: 7 (DW_TAG_structure_type)
    <7ca>   DW_AT_byte_size   : 40
    <7cb>   DW_AT_decl_file   : 6
    <7cc>   DW_AT_decl_line   : 46
    <7cd>   DW_AT_decl_column : 9
    <7ce>   DW_AT_sibling     : <0x855>
 <2><7d2>: Abbrev Number: 8 (DW_TAG_member)
    <7d3>   DW_AT_name        : (indirect string, offset: 0x12f29f): PLLState
    <7d7>   DW_AT_decl_file   : 6
    <7d8>   DW_AT_decl_line   : 48
    <7d9>   DW_AT_decl_column : 12
    <7da>   DW_AT_type        : <0x77c>
    <7de>   DW_AT_data_member_location: 0
 <2><7df>: Abbrev Number: 8 (DW_TAG_member)
    <7e0>   DW_AT_name        : (indirect string, offset: 0x12f4d6): PLLSource
    <7e4>   DW_AT_decl_file   : 6
    <7e5>   DW_AT_decl_line   : 51
    <7e6>   DW_AT_decl_column : 12
    <7e7>   DW_AT_type        : <0x77c>
    <7eb>   DW_AT_data_member_location: 4
 <2><7ec>: Abbrev Number: 8 (DW_TAG_member)
    <7ed>   DW_AT_name        : (indirect string, offset: 0x12f50d): PLLM
    <7f1>   DW_AT_decl_file   : 6
    <7f2>   DW_AT_decl_line   : 54
    <7f3>   DW_AT_decl_column : 12
    <7f4>   DW_AT_type        : <0x77c>
    <7f8>   DW_AT_data_member_location: 8
 <2><7f9>: Abbrev Number: 8 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0x12f2d2): PLLMBOOST
    <7fe>   DW_AT_decl_file   : 6
    <7ff>   DW_AT_decl_line   : 57
    <800>   DW_AT_decl_column : 12
    <801>   DW_AT_type        : <0x77c>
    <805>   DW_AT_data_member_location: 12
 <2><806>: Abbrev Number: 8 (DW_TAG_member)
    <807>   DW_AT_name        : (indirect string, offset: 0x12f512): PLLN
    <80b>   DW_AT_decl_file   : 6
    <80c>   DW_AT_decl_line   : 60
    <80d>   DW_AT_decl_column : 12
    <80e>   DW_AT_type        : <0x77c>
    <812>   DW_AT_data_member_location: 16
 <2><813>: Abbrev Number: 8 (DW_TAG_member)
    <814>   DW_AT_name        : (indirect string, offset: 0x12f4d1): PLLP
    <818>   DW_AT_decl_file   : 6
    <819>   DW_AT_decl_line   : 63
    <81a>   DW_AT_decl_column : 12
    <81b>   DW_AT_type        : <0x77c>
    <81f>   DW_AT_data_member_location: 20
 <2><820>: Abbrev Number: 8 (DW_TAG_member)
    <821>   DW_AT_name        : (indirect string, offset: 0x36ccb): PLLQ
    <825>   DW_AT_decl_file   : 6
    <826>   DW_AT_decl_line   : 66
    <827>   DW_AT_decl_column : 12
    <828>   DW_AT_type        : <0x77c>
    <82c>   DW_AT_data_member_location: 24
 <2><82d>: Abbrev Number: 8 (DW_TAG_member)
    <82e>   DW_AT_name        : (indirect string, offset: 0x12f517): PLLR
    <832>   DW_AT_decl_file   : 6
    <833>   DW_AT_decl_line   : 69
    <834>   DW_AT_decl_column : 12
    <835>   DW_AT_type        : <0x77c>
    <839>   DW_AT_data_member_location: 28
 <2><83a>: Abbrev Number: 8 (DW_TAG_member)
    <83b>   DW_AT_name        : (indirect string, offset: 0x12f4e0): PLLRGE
    <83f>   DW_AT_decl_file   : 6
    <840>   DW_AT_decl_line   : 73
    <841>   DW_AT_decl_column : 12
    <842>   DW_AT_type        : <0x77c>
    <846>   DW_AT_data_member_location: 32
 <2><847>: Abbrev Number: 8 (DW_TAG_member)
    <848>   DW_AT_name        : (indirect string, offset: 0x12f45d): PLLFRACN
    <84c>   DW_AT_decl_file   : 6
    <84d>   DW_AT_decl_line   : 76
    <84e>   DW_AT_decl_column : 12
    <84f>   DW_AT_type        : <0x77c>
    <853>   DW_AT_data_member_location: 36
 <2><854>: Abbrev Number: 0
 <1><855>: Abbrev Number: 4 (DW_TAG_typedef)
    <856>   DW_AT_name        : (indirect string, offset: 0x12f28c): RCC_PLLInitTypeDef
    <85a>   DW_AT_decl_file   : 6
    <85b>   DW_AT_decl_line   : 79
    <85c>   DW_AT_decl_column : 3
    <85d>   DW_AT_type        : <0x7c9>
 <1><861>: Abbrev Number: 7 (DW_TAG_structure_type)
    <862>   DW_AT_byte_size   : 96
    <863>   DW_AT_decl_file   : 6
    <864>   DW_AT_decl_line   : 84
    <865>   DW_AT_decl_column : 9
    <866>   DW_AT_sibling     : <0x92e>
 <2><86a>: Abbrev Number: 8 (DW_TAG_member)
    <86b>   DW_AT_name        : (indirect string, offset: 0x12f353): OscillatorType
    <86f>   DW_AT_decl_file   : 6
    <870>   DW_AT_decl_line   : 86
    <871>   DW_AT_decl_column : 12
    <872>   DW_AT_type        : <0x77c>
    <876>   DW_AT_data_member_location: 0
 <2><877>: Abbrev Number: 8 (DW_TAG_member)
    <878>   DW_AT_name        : (indirect string, offset: 0x12f526): HSEState
    <87c>   DW_AT_decl_file   : 6
    <87d>   DW_AT_decl_line   : 89
    <87e>   DW_AT_decl_column : 12
    <87f>   DW_AT_type        : <0x77c>
    <883>   DW_AT_data_member_location: 4
 <2><884>: Abbrev Number: 8 (DW_TAG_member)
    <885>   DW_AT_name        : (indirect string, offset: 0x12f466): LSEState
    <889>   DW_AT_decl_file   : 6
    <88a>   DW_AT_decl_line   : 92
    <88b>   DW_AT_decl_column : 12
    <88c>   DW_AT_type        : <0x77c>
    <890>   DW_AT_data_member_location: 8
 <2><891>: Abbrev Number: 8 (DW_TAG_member)
    <892>   DW_AT_name        : (indirect string, offset: 0x12f470): HSIState
    <896>   DW_AT_decl_file   : 6
    <897>   DW_AT_decl_line   : 95
    <898>   DW_AT_decl_column : 12
    <899>   DW_AT_type        : <0x77c>
    <89d>   DW_AT_data_member_location: 12
 <2><89e>: Abbrev Number: 8 (DW_TAG_member)
    <89f>   DW_AT_name        : (indirect string, offset: 0x12f37e): HSICalibrationValue
    <8a3>   DW_AT_decl_file   : 6
    <8a4>   DW_AT_decl_line   : 98
    <8a5>   DW_AT_decl_column : 12
    <8a6>   DW_AT_type        : <0x77c>
    <8aa>   DW_AT_data_member_location: 16
 <2><8ab>: Abbrev Number: 8 (DW_TAG_member)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x12f34a): LSIState
    <8b0>   DW_AT_decl_file   : 6
    <8b1>   DW_AT_decl_line   : 102
    <8b2>   DW_AT_decl_column : 12
    <8b3>   DW_AT_type        : <0x77c>
    <8b7>   DW_AT_data_member_location: 20
 <2><8b8>: Abbrev Number: 8 (DW_TAG_member)
    <8b9>   DW_AT_name        : (indirect string, offset: 0x12f3b8): LSIDiv
    <8bd>   DW_AT_decl_file   : 6
    <8be>   DW_AT_decl_line   : 105
    <8bf>   DW_AT_decl_column : 12
    <8c0>   DW_AT_type        : <0x77c>
    <8c4>   DW_AT_data_member_location: 24
 <2><8c5>: Abbrev Number: 8 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x12f2a8): MSIState
    <8ca>   DW_AT_decl_file   : 6
    <8cb>   DW_AT_decl_line   : 108
    <8cc>   DW_AT_decl_column : 12
    <8cd>   DW_AT_type        : <0x77c>
    <8d1>   DW_AT_data_member_location: 28
 <2><8d2>: Abbrev Number: 8 (DW_TAG_member)
    <8d3>   DW_AT_name        : (indirect string, offset: 0x12f479): MSICalibrationValue
    <8d7>   DW_AT_decl_file   : 6
    <8d8>   DW_AT_decl_line   : 111
    <8d9>   DW_AT_decl_column : 12
    <8da>   DW_AT_type        : <0x77c>
    <8de>   DW_AT_data_member_location: 32
 <2><8df>: Abbrev Number: 8 (DW_TAG_member)
    <8e0>   DW_AT_name        : (indirect string, offset: 0x12f4e7): MSIClockRange
    <8e4>   DW_AT_decl_file   : 6
    <8e5>   DW_AT_decl_line   : 114
    <8e6>   DW_AT_decl_column : 12
    <8e7>   DW_AT_type        : <0x77c>
    <8eb>   DW_AT_data_member_location: 36
 <2><8ec>: Abbrev Number: 8 (DW_TAG_member)
    <8ed>   DW_AT_name        : (indirect string, offset: 0x12f41a): MSIKClockRange
    <8f1>   DW_AT_decl_file   : 6
    <8f2>   DW_AT_decl_line   : 117
    <8f3>   DW_AT_decl_column : 12
    <8f4>   DW_AT_type        : <0x77c>
    <8f8>   DW_AT_data_member_location: 40
 <2><8f9>: Abbrev Number: 8 (DW_TAG_member)
    <8fa>   DW_AT_name        : (indirect string, offset: 0x12f3bf): HSI48State
    <8fe>   DW_AT_decl_file   : 6
    <8ff>   DW_AT_decl_line   : 120
    <900>   DW_AT_decl_column : 12
    <901>   DW_AT_type        : <0x77c>
    <905>   DW_AT_data_member_location: 44
 <2><906>: Abbrev Number: 8 (DW_TAG_member)
    <907>   DW_AT_name        : (indirect string, offset: 0x12f46f): SHSIState
    <90b>   DW_AT_decl_file   : 6
    <90c>   DW_AT_decl_line   : 123
    <90d>   DW_AT_decl_column : 12
    <90e>   DW_AT_type        : <0x77c>
    <912>   DW_AT_data_member_location: 48
 <2><913>: Abbrev Number: 8 (DW_TAG_member)
    <914>   DW_AT_name        : (indirect string, offset: 0x12f3eb): MSIKState
    <918>   DW_AT_decl_file   : 6
    <919>   DW_AT_decl_line   : 126
    <91a>   DW_AT_decl_column : 12
    <91b>   DW_AT_type        : <0x77c>
    <91f>   DW_AT_data_member_location: 52
 <2><920>: Abbrev Number: 9 (DW_TAG_member)
    <921>   DW_AT_name        : PLL
    <925>   DW_AT_decl_file   : 6
    <926>   DW_AT_decl_line   : 129
    <927>   DW_AT_decl_column : 22
    <928>   DW_AT_type        : <0x855>
    <92c>   DW_AT_data_member_location: 56
 <2><92d>: Abbrev Number: 0
 <1><92e>: Abbrev Number: 4 (DW_TAG_typedef)
    <92f>   DW_AT_name        : (indirect string, offset: 0x12f3a5): RCC_OscInitTypeDef
    <933>   DW_AT_decl_file   : 6
    <934>   DW_AT_decl_line   : 131
    <935>   DW_AT_decl_column : 3
    <936>   DW_AT_type        : <0x861>
 <1><93a>: Abbrev Number: 10 (DW_TAG_const_type)
    <93b>   DW_AT_type        : <0x92e>
 <1><93f>: Abbrev Number: 7 (DW_TAG_structure_type)
    <940>   DW_AT_byte_size   : 24
    <941>   DW_AT_decl_file   : 6
    <942>   DW_AT_decl_line   : 136
    <943>   DW_AT_decl_column : 9
    <944>   DW_AT_sibling     : <0x997>
 <2><948>: Abbrev Number: 8 (DW_TAG_member)
    <949>   DW_AT_name        : (indirect string, offset: 0x12f49f): ClockType
    <94d>   DW_AT_decl_file   : 6
    <94e>   DW_AT_decl_line   : 138
    <94f>   DW_AT_decl_column : 12
    <950>   DW_AT_type        : <0x77c>
    <954>   DW_AT_data_member_location: 0
 <2><955>: Abbrev Number: 8 (DW_TAG_member)
    <956>   DW_AT_name        : (indirect string, offset: 0x12f313): SYSCLKSource
    <95a>   DW_AT_decl_file   : 6
    <95b>   DW_AT_decl_line   : 141
    <95c>   DW_AT_decl_column : 12
    <95d>   DW_AT_type        : <0x77c>
    <961>   DW_AT_data_member_location: 4
 <2><962>: Abbrev Number: 8 (DW_TAG_member)
    <963>   DW_AT_name        : (indirect string, offset: 0x12f3f5): AHBCLKDivider
    <967>   DW_AT_decl_file   : 6
    <968>   DW_AT_decl_line   : 144
    <969>   DW_AT_decl_column : 12
    <96a>   DW_AT_type        : <0x77c>
    <96e>   DW_AT_data_member_location: 8
 <2><96f>: Abbrev Number: 8 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0x12f4a9): APB1CLKDivider
    <974>   DW_AT_decl_file   : 6
    <975>   DW_AT_decl_line   : 148
    <976>   DW_AT_decl_column : 12
    <977>   DW_AT_type        : <0x77c>
    <97b>   DW_AT_data_member_location: 12
 <2><97c>: Abbrev Number: 8 (DW_TAG_member)
    <97d>   DW_AT_name        : (indirect string, offset: 0x12f320): APB2CLKDivider
    <981>   DW_AT_decl_file   : 6
    <982>   DW_AT_decl_line   : 151
    <983>   DW_AT_decl_column : 12
    <984>   DW_AT_type        : <0x77c>
    <988>   DW_AT_data_member_location: 16
 <2><989>: Abbrev Number: 8 (DW_TAG_member)
    <98a>   DW_AT_name        : (indirect string, offset: 0x12f4fe): APB3CLKDivider
    <98e>   DW_AT_decl_file   : 6
    <98f>   DW_AT_decl_line   : 154
    <990>   DW_AT_decl_column : 12
    <991>   DW_AT_type        : <0x77c>
    <995>   DW_AT_data_member_location: 20
 <2><996>: Abbrev Number: 0
 <1><997>: Abbrev Number: 4 (DW_TAG_typedef)
    <998>   DW_AT_name        : (indirect string, offset: 0x12f3ca): RCC_ClkInitTypeDef
    <99c>   DW_AT_decl_file   : 6
    <99d>   DW_AT_decl_line   : 156
    <99e>   DW_AT_decl_column : 3
    <99f>   DW_AT_type        : <0x93f>
 <1><9a3>: Abbrev Number: 10 (DW_TAG_const_type)
    <9a4>   DW_AT_type        : <0x997>
 <1><9a8>: Abbrev Number: 11 (DW_TAG_subprogram)
    <9a9>   DW_AT_external    : 1
    <9a9>   DW_AT_name        : (indirect string, offset: 0x12f48d): HAL_ICACHE_Enable
    <9ad>   DW_AT_decl_file   : 7
    <9ae>   DW_AT_decl_line   : 227
    <9af>   DW_AT_decl_column : 19
    <9b0>   DW_AT_prototyped  : 1
    <9b0>   DW_AT_type        : <0x7bd>
    <9b4>   DW_AT_declaration : 1
 <1><9b4>: Abbrev Number: 12 (DW_TAG_subprogram)
    <9b5>   DW_AT_external    : 1
    <9b5>   DW_AT_name        : (indirect string, offset: 0x12f2f0): HAL_ICACHE_ConfigAssociativityMode
    <9b9>   DW_AT_decl_file   : 7
    <9ba>   DW_AT_decl_line   : 230
    <9bb>   DW_AT_decl_column : 19
    <9bc>   DW_AT_prototyped  : 1
    <9bc>   DW_AT_type        : <0x7bd>
    <9c0>   DW_AT_declaration : 1
    <9c0>   DW_AT_sibling     : <0x9ca>
 <2><9c4>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9c5>   DW_AT_type        : <0x77c>
 <2><9c9>: Abbrev Number: 0
 <1><9ca>: Abbrev Number: 14 (DW_TAG_subprogram)
    <9cb>   DW_AT_external    : 1
    <9cb>   DW_AT_name        : (indirect string, offset: 0x12f403): HAL_PWREx_ConfigSupply
    <9cf>   DW_AT_decl_file   : 8
    <9d0>   DW_AT_decl_line   : 989
    <9d2>   DW_AT_decl_column : 19
    <9d3>   DW_AT_prototyped  : 1
    <9d3>   DW_AT_type        : <0x7bd>
    <9d7>   DW_AT_declaration : 1
    <9d7>   DW_AT_sibling     : <0x9e1>
 <2><9db>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9dc>   DW_AT_type        : <0x77c>
 <2><9e0>: Abbrev Number: 0
 <1><9e1>: Abbrev Number: 14 (DW_TAG_subprogram)
    <9e2>   DW_AT_external    : 1
    <9e2>   DW_AT_name        : (indirect string, offset: 0x12f429): HAL_RCC_ClockConfig
    <9e6>   DW_AT_decl_file   : 6
    <9e7>   DW_AT_decl_line   : 4763
    <9e9>   DW_AT_decl_column : 19
    <9ea>   DW_AT_prototyped  : 1
    <9ea>   DW_AT_type        : <0x7bd>
    <9ee>   DW_AT_declaration : 1
    <9ee>   DW_AT_sibling     : <0x9fd>
 <2><9f2>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9f3>   DW_AT_type        : <0xa03>
 <2><9f7>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <9f8>   DW_AT_type        : <0x77c>
 <2><9fc>: Abbrev Number: 0
 <1><9fd>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <9fe>   DW_AT_byte_size   : 4
    <9ff>   DW_AT_type        : <0x9a3>
 <1><a03>: Abbrev Number: 10 (DW_TAG_const_type)
    <a04>   DW_AT_type        : <0x9fd>
 <1><a08>: Abbrev Number: 14 (DW_TAG_subprogram)
    <a09>   DW_AT_external    : 1
    <a09>   DW_AT_name        : (indirect string, offset: 0x12f362): HAL_RCC_OscConfig
    <a0d>   DW_AT_decl_file   : 6
    <a0e>   DW_AT_decl_line   : 4762
    <a10>   DW_AT_decl_column : 19
    <a11>   DW_AT_prototyped  : 1
    <a11>   DW_AT_type        : <0x7bd>
    <a15>   DW_AT_declaration : 1
    <a15>   DW_AT_sibling     : <0xa1f>
 <2><a19>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <a1a>   DW_AT_type        : <0xa1f>
 <2><a1e>: Abbrev Number: 0
 <1><a1f>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <a20>   DW_AT_byte_size   : 4
    <a21>   DW_AT_type        : <0x93a>
 <1><a25>: Abbrev Number: 14 (DW_TAG_subprogram)
    <a26>   DW_AT_external    : 1
    <a26>   DW_AT_name        : (indirect string, offset: 0x12f43d): HAL_PWREx_ControlVoltageScaling
    <a2a>   DW_AT_decl_file   : 8
    <a2b>   DW_AT_decl_line   : 987
    <a2d>   DW_AT_decl_column : 19
    <a2e>   DW_AT_prototyped  : 1
    <a2e>   DW_AT_type        : <0x7bd>
    <a32>   DW_AT_declaration : 1
    <a32>   DW_AT_sibling     : <0xa3c>
 <2><a36>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <a37>   DW_AT_type        : <0x77c>
 <2><a3b>: Abbrev Number: 0
 <1><a3c>: Abbrev Number: 16 (DW_TAG_subprogram)
    <a3d>   DW_AT_external    : 1
    <a3d>   DW_AT_name        : (indirect string, offset: 0x12f27c): MX_ThreadX_Init
    <a41>   DW_AT_decl_file   : 10
    <a42>   DW_AT_decl_line   : 65
    <a43>   DW_AT_decl_column : 6
    <a44>   DW_AT_prototyped  : 1
    <a44>   DW_AT_declaration : 1
 <1><a44>: Abbrev Number: 17 (DW_TAG_subprogram)
    <a45>   DW_AT_external    : 1
    <a45>   DW_AT_name        : (indirect string, offset: 0x12f4f5): HAL_Init
    <a49>   DW_AT_decl_file   : 9
    <a4a>   DW_AT_decl_line   : 695
    <a4c>   DW_AT_decl_column : 19
    <a4d>   DW_AT_prototyped  : 1
    <a4d>   DW_AT_type        : <0x7bd>
    <a51>   DW_AT_declaration : 1
 <1><a51>: Abbrev Number: 18 (DW_TAG_subprogram)
    <a52>   DW_AT_external    : 1
    <a52>   DW_AT_name        : (indirect string, offset: 0x12f3dd): Error_Handler
    <a56>   DW_AT_decl_file   : 1
    <a57>   DW_AT_decl_line   : 214
    <a58>   DW_AT_decl_column : 6
    <a59>   DW_AT_prototyped  : 1
    <a59>   DW_AT_low_pc      : 0x8000610
    <a5d>   DW_AT_high_pc     : 0xa
    <a61>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a63>   DW_AT_GNU_all_call_sites: 1
    <a63>   DW_AT_sibling     : <0xa78>
 <2><a67>: Abbrev Number: 19 (DW_TAG_inlined_subroutine)
    <a68>   DW_AT_abstract_origin: <0xae9>
    <a6c>   DW_AT_low_pc      : 0x8000614
    <a70>   DW_AT_high_pc     : 0x4
    <a74>   DW_AT_call_file   : 1
    <a75>   DW_AT_call_line   : 218
    <a76>   DW_AT_call_column : 3
 <2><a77>: Abbrev Number: 0
 <1><a78>: Abbrev Number: 20 (DW_TAG_subprogram)
    <a79>   DW_AT_name        : (indirect string, offset: 0x12f33b): MX_ICACHE_Init
    <a7d>   DW_AT_decl_file   : 1
    <a7e>   DW_AT_decl_line   : 179
    <a7f>   DW_AT_decl_column : 13
    <a80>   DW_AT_prototyped  : 1
    <a80>   DW_AT_low_pc      : 0x80005ea
    <a84>   DW_AT_high_pc     : 0x26
    <a88>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a8a>   DW_AT_GNU_all_tail_call_sites: 1
 <1><a8a>: Abbrev Number: 20 (DW_TAG_subprogram)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x12f52f): SystemPower_Config
    <a8f>   DW_AT_decl_file   : 1
    <a90>   DW_AT_decl_line   : 160
    <a91>   DW_AT_decl_column : 13
    <a92>   DW_AT_prototyped  : 1
    <a92>   DW_AT_low_pc      : 0x80005d2
    <a96>   DW_AT_high_pc     : 0x18
    <a9a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a9c>   DW_AT_GNU_all_tail_call_sites: 1
 <1><a9c>: Abbrev Number: 21 (DW_TAG_subprogram)
    <a9d>   DW_AT_external    : 1
    <a9d>   DW_AT_name        : (indirect string, offset: 0x12f2bf): SystemClock_Config
    <aa1>   DW_AT_decl_file   : 1
    <aa2>   DW_AT_decl_line   : 115
    <aa3>   DW_AT_decl_column : 6
    <aa4>   DW_AT_prototyped  : 1
    <aa4>   DW_AT_low_pc      : 0x8000540
    <aa8>   DW_AT_high_pc     : 0x92
    <aac>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <aae>   DW_AT_GNU_all_tail_call_sites: 1
    <aae>   DW_AT_sibling     : <0xad3>
 <2><ab2>: Abbrev Number: 22 (DW_TAG_variable)
    <ab3>   DW_AT_name        : (indirect string, offset: 0x132736): RCC_OscInitStruct
    <ab7>   DW_AT_decl_file   : 1
    <ab8>   DW_AT_decl_line   : 117
    <ab9>   DW_AT_decl_column : 22
    <aba>   DW_AT_type        : <0x92e>
    <abe>   DW_AT_location    : 3 byte block: 91 98 7f 	(DW_OP_fbreg: -104)
 <2><ac2>: Abbrev Number: 22 (DW_TAG_variable)
    <ac3>   DW_AT_name        : (indirect string, offset: 0x1321a3): RCC_ClkInitStruct
    <ac7>   DW_AT_decl_file   : 1
    <ac8>   DW_AT_decl_line   : 118
    <ac9>   DW_AT_decl_column : 22
    <aca>   DW_AT_type        : <0x997>
    <ace>   DW_AT_location    : 3 byte block: 91 80 7f 	(DW_OP_fbreg: -128)
 <2><ad2>: Abbrev Number: 0
 <1><ad3>: Abbrev Number: 23 (DW_TAG_subprogram)
    <ad4>   DW_AT_external    : 1
    <ad4>   DW_AT_name        : (indirect string, offset: 0x1318fd): main
    <ad8>   DW_AT_decl_file   : 1
    <ad9>   DW_AT_decl_line   : 66
    <ada>   DW_AT_decl_column : 5
    <adb>   DW_AT_prototyped  : 1
    <adb>   DW_AT_type        : <0x723>
    <adf>   DW_AT_low_pc      : 0x8000526
    <ae3>   DW_AT_high_pc     : 0x1a
    <ae7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ae9>   DW_AT_GNU_all_tail_call_sites: 1
 <1><ae9>: Abbrev Number: 24 (DW_TAG_subprogram)
    <aea>   DW_AT_name        : (indirect string, offset: 0x12f2b1): __disable_irq
    <aee>   DW_AT_decl_file   : 2
    <aef>   DW_AT_decl_line   : 207
    <af0>   DW_AT_decl_column : 27
    <af1>   DW_AT_prototyped  : 1
    <af1>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><af2>: Abbrev Number: 0
  Compilation Unit @ offset 0xaf3:
   Length:        0x489 (32-bit)
   Version:       4
   Abbrev Offset: 0x375
   Pointer Size:  4
 <0><afe>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <aff>   DW_AT_producer    : (indirect string, offset: 0xcb293): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m33 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv8-m.main+dsp+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <b03>   DW_AT_language    : 12	(ANSI C99)
    <b04>   DW_AT_name        : (indirect string, offset: 0x12f62e): ../Core/Src/stm32u5xx_hal_msp.c
    <b08>   DW_AT_comp_dir    : (indirect string, offset: 0xb9e14): F:/Grutter_Services_LLC/Repositories/STMCube-ThreadX/Debug
    <b0c>   DW_AT_ranges      : 0x58
    <b10>   DW_AT_low_pc      : 0x0
    <b14>   DW_AT_stmt_list   : 0x17bc
    <b18>   DW_AT_GNU_macros  : 0x2ff39
 <1><b1c>: Abbrev Number: 2 (DW_TAG_base_type)
    <b1d>   DW_AT_byte_size   : 1
    <b1e>   DW_AT_encoding    : 6	(signed char)
    <b1f>   DW_AT_name        : (indirect string, offset: 0x10544e): signed char
 <1><b23>: Abbrev Number: 2 (DW_TAG_base_type)
    <b24>   DW_AT_byte_size   : 1
    <b25>   DW_AT_encoding    : 8	(unsigned char)
    <b26>   DW_AT_name        : (indirect string, offset: 0x98919): unsigned char
 <1><b2a>: Abbrev Number: 2 (DW_TAG_base_type)
    <b2b>   DW_AT_byte_size   : 2
    <b2c>   DW_AT_encoding    : 5	(signed)
    <b2d>   DW_AT_name        : (indirect string, offset: 0x7f4a9): short int
 <1><b31>: Abbrev Number: 2 (DW_TAG_base_type)
    <b32>   DW_AT_byte_size   : 2
    <b33>   DW_AT_encoding    : 7	(unsigned)
    <b34>   DW_AT_name        : (indirect string, offset: 0x57342): short unsigned int
 <1><b38>: Abbrev Number: 2 (DW_TAG_base_type)
    <b39>   DW_AT_byte_size   : 4
    <b3a>   DW_AT_encoding    : 5	(signed)
    <b3b>   DW_AT_name        : (indirect string, offset: 0x104682): long int
 <1><b3f>: Abbrev Number: 3 (DW_TAG_typedef)
    <b40>   DW_AT_name        : (indirect string, offset: 0x12f2dc): __uint32_t
    <b44>   DW_AT_decl_file   : 2
    <b45>   DW_AT_decl_line   : 79
    <b46>   DW_AT_decl_column : 25
    <b47>   DW_AT_type        : <0xb4b>
 <1><b4b>: Abbrev Number: 2 (DW_TAG_base_type)
    <b4c>   DW_AT_byte_size   : 4
    <b4d>   DW_AT_encoding    : 7	(unsigned)
    <b4e>   DW_AT_name        : (indirect string, offset: 0xc04a5): long unsigned int
 <1><b52>: Abbrev Number: 2 (DW_TAG_base_type)
    <b53>   DW_AT_byte_size   : 8
    <b54>   DW_AT_encoding    : 5	(signed)
    <b55>   DW_AT_name        : (indirect string, offset: 0x8f52): long long int
 <1><b59>: Abbrev Number: 2 (DW_TAG_base_type)
    <b5a>   DW_AT_byte_size   : 8
    <b5b>   DW_AT_encoding    : 7	(unsigned)
    <b5c>   DW_AT_name        : (indirect string, offset: 0x9afef): long long unsigned int
 <1><b60>: Abbrev Number: 4 (DW_TAG_base_type)
    <b61>   DW_AT_byte_size   : 4
    <b62>   DW_AT_encoding    : 5	(signed)
    <b63>   DW_AT_name        : int
 <1><b67>: Abbrev Number: 2 (DW_TAG_base_type)
    <b68>   DW_AT_byte_size   : 4
    <b69>   DW_AT_encoding    : 7	(unsigned)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x8cccb): unsigned int
 <1><b6e>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x12f2de): uint32_t
    <b73>   DW_AT_decl_file   : 3
    <b74>   DW_AT_decl_line   : 48
    <b75>   DW_AT_decl_column : 20
    <b76>   DW_AT_type        : <0xb3f>
 <1><b7a>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <b7b>   DW_AT_type        : <0xb6e>
 <1><b7f>: Abbrev Number: 6 (DW_TAG_array_type)
    <b80>   DW_AT_type        : <0xb6e>
    <b84>   DW_AT_sibling     : <0xb8f>
 <2><b88>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <b89>   DW_AT_type        : <0xb67>
    <b8d>   DW_AT_upper_bound : 5
 <2><b8e>: Abbrev Number: 0
 <1><b8f>: Abbrev Number: 8 (DW_TAG_structure_type)
    <b90>   DW_AT_byte_size   : 280
    <b92>   DW_AT_decl_file   : 4
    <b93>   DW_AT_decl_line   : 1016
    <b95>   DW_AT_decl_column : 9
    <b96>   DW_AT_sibling     : <0xf2a>
 <2><b9a>: Abbrev Number: 9 (DW_TAG_member)
    <b9b>   DW_AT_name        : CR
    <b9e>   DW_AT_decl_file   : 4
    <b9f>   DW_AT_decl_line   : 1018
    <ba1>   DW_AT_decl_column : 17
    <ba2>   DW_AT_type        : <0xb7a>
    <ba6>   DW_AT_data_member_location: 0
 <2><ba7>: Abbrev Number: 10 (DW_TAG_member)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x12f5c8): RESERVED0
    <bac>   DW_AT_decl_file   : 4
    <bad>   DW_AT_decl_line   : 1019
    <baf>   DW_AT_decl_column : 17
    <bb0>   DW_AT_type        : <0xb6e>
    <bb4>   DW_AT_data_member_location: 4
 <2><bb5>: Abbrev Number: 10 (DW_TAG_member)
    <bb6>   DW_AT_name        : (indirect string, offset: 0x12f567): ICSCR1
    <bba>   DW_AT_decl_file   : 4
    <bbb>   DW_AT_decl_line   : 1020
    <bbd>   DW_AT_decl_column : 17
    <bbe>   DW_AT_type        : <0xb7a>
    <bc2>   DW_AT_data_member_location: 8
 <2><bc3>: Abbrev Number: 10 (DW_TAG_member)
    <bc4>   DW_AT_name        : (indirect string, offset: 0x12f56e): ICSCR2
    <bc8>   DW_AT_decl_file   : 4
    <bc9>   DW_AT_decl_line   : 1021
    <bcb>   DW_AT_decl_column : 17
    <bcc>   DW_AT_type        : <0xb7a>
    <bd0>   DW_AT_data_member_location: 12
 <2><bd1>: Abbrev Number: 10 (DW_TAG_member)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x12f575): ICSCR3
    <bd6>   DW_AT_decl_file   : 4
    <bd7>   DW_AT_decl_line   : 1022
    <bd9>   DW_AT_decl_column : 17
    <bda>   DW_AT_type        : <0xb7a>
    <bde>   DW_AT_data_member_location: 16
 <2><bdf>: Abbrev Number: 10 (DW_TAG_member)
    <be0>   DW_AT_name        : (indirect string, offset: 0x12f57c): CRRCR
    <be4>   DW_AT_decl_file   : 4
    <be5>   DW_AT_decl_line   : 1023
    <be7>   DW_AT_decl_column : 17
    <be8>   DW_AT_type        : <0xb7a>
    <bec>   DW_AT_data_member_location: 20
 <2><bed>: Abbrev Number: 10 (DW_TAG_member)
    <bee>   DW_AT_name        : (indirect string, offset: 0x12f5d2): RESERVED1
    <bf2>   DW_AT_decl_file   : 4
    <bf3>   DW_AT_decl_line   : 1024
    <bf5>   DW_AT_decl_column : 17
    <bf6>   DW_AT_type        : <0xb6e>
    <bfa>   DW_AT_data_member_location: 24
 <2><bfb>: Abbrev Number: 10 (DW_TAG_member)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x1316e2): CFGR1
    <c00>   DW_AT_decl_file   : 4
    <c01>   DW_AT_decl_line   : 1025
    <c03>   DW_AT_decl_column : 17
    <c04>   DW_AT_type        : <0xb7a>
    <c08>   DW_AT_data_member_location: 28
 <2><c09>: Abbrev Number: 10 (DW_TAG_member)
    <c0a>   DW_AT_name        : (indirect string, offset: 0x12f597): CFGR2
    <c0e>   DW_AT_decl_file   : 4
    <c0f>   DW_AT_decl_line   : 1026
    <c11>   DW_AT_decl_column : 17
    <c12>   DW_AT_type        : <0xb7a>
    <c16>   DW_AT_data_member_location: 32
 <2><c17>: Abbrev Number: 10 (DW_TAG_member)
    <c18>   DW_AT_name        : (indirect string, offset: 0x12f60b): CFGR3
    <c1c>   DW_AT_decl_file   : 4
    <c1d>   DW_AT_decl_line   : 1027
    <c1f>   DW_AT_decl_column : 17
    <c20>   DW_AT_type        : <0xb7a>
    <c24>   DW_AT_data_member_location: 36
 <2><c25>: Abbrev Number: 10 (DW_TAG_member)
    <c26>   DW_AT_name        : (indirect string, offset: 0x12f69d): PLL1CFGR
    <c2a>   DW_AT_decl_file   : 4
    <c2b>   DW_AT_decl_line   : 1028
    <c2d>   DW_AT_decl_column : 17
    <c2e>   DW_AT_type        : <0xb7a>
    <c32>   DW_AT_data_member_location: 40
 <2><c33>: Abbrev Number: 10 (DW_TAG_member)
    <c34>   DW_AT_name        : (indirect string, offset: 0x12f792): PLL2CFGR
    <c38>   DW_AT_decl_file   : 4
    <c39>   DW_AT_decl_line   : 1029
    <c3b>   DW_AT_decl_column : 17
    <c3c>   DW_AT_type        : <0xb7a>
    <c40>   DW_AT_data_member_location: 44
 <2><c41>: Abbrev Number: 10 (DW_TAG_member)
    <c42>   DW_AT_name        : (indirect string, offset: 0x12f6c0): PLL3CFGR
    <c46>   DW_AT_decl_file   : 4
    <c47>   DW_AT_decl_line   : 1030
    <c49>   DW_AT_decl_column : 17
    <c4a>   DW_AT_type        : <0xb7a>
    <c4e>   DW_AT_data_member_location: 48
 <2><c4f>: Abbrev Number: 10 (DW_TAG_member)
    <c50>   DW_AT_name        : (indirect string, offset: 0x12f5a4): PLL1DIVR
    <c54>   DW_AT_decl_file   : 4
    <c55>   DW_AT_decl_line   : 1031
    <c57>   DW_AT_decl_column : 17
    <c58>   DW_AT_type        : <0xb7a>
    <c5c>   DW_AT_data_member_location: 52
 <2><c5d>: Abbrev Number: 10 (DW_TAG_member)
    <c5e>   DW_AT_name        : (indirect string, offset: 0x12f760): PLL1FRACR
    <c62>   DW_AT_decl_file   : 4
    <c63>   DW_AT_decl_line   : 1032
    <c65>   DW_AT_decl_column : 17
    <c66>   DW_AT_type        : <0xb7a>
    <c6a>   DW_AT_data_member_location: 56
 <2><c6b>: Abbrev Number: 10 (DW_TAG_member)
    <c6c>   DW_AT_name        : (indirect string, offset: 0x12f5bf): PLL2DIVR
    <c70>   DW_AT_decl_file   : 4
    <c71>   DW_AT_decl_line   : 1033
    <c73>   DW_AT_decl_column : 17
    <c74>   DW_AT_type        : <0xb7a>
    <c78>   DW_AT_data_member_location: 60
 <2><c79>: Abbrev Number: 10 (DW_TAG_member)
    <c7a>   DW_AT_name        : (indirect string, offset: 0x12f6fb): PLL2FRACR
    <c7e>   DW_AT_decl_file   : 4
    <c7f>   DW_AT_decl_line   : 1034
    <c81>   DW_AT_decl_column : 17
    <c82>   DW_AT_type        : <0xb7a>
    <c86>   DW_AT_data_member_location: 64
 <2><c87>: Abbrev Number: 10 (DW_TAG_member)
    <c88>   DW_AT_name        : (indirect string, offset: 0x12f61b): PLL3DIVR
    <c8c>   DW_AT_decl_file   : 4
    <c8d>   DW_AT_decl_line   : 1035
    <c8f>   DW_AT_decl_column : 17
    <c90>   DW_AT_type        : <0xb7a>
    <c94>   DW_AT_data_member_location: 68
 <2><c95>: Abbrev Number: 10 (DW_TAG_member)
    <c96>   DW_AT_name        : (indirect string, offset: 0x12f6f1): PLL3FRACR
    <c9a>   DW_AT_decl_file   : 4
    <c9b>   DW_AT_decl_line   : 1036
    <c9d>   DW_AT_decl_column : 17
    <c9e>   DW_AT_type        : <0xb7a>
    <ca2>   DW_AT_data_member_location: 72
 <2><ca3>: Abbrev Number: 10 (DW_TAG_member)
    <ca4>   DW_AT_name        : (indirect string, offset: 0x12f5dc): RESERVED2
    <ca8>   DW_AT_decl_file   : 4
    <ca9>   DW_AT_decl_line   : 1037
    <cab>   DW_AT_decl_column : 17
    <cac>   DW_AT_type        : <0xb6e>
    <cb0>   DW_AT_data_member_location: 76
 <2><cb1>: Abbrev Number: 10 (DW_TAG_member)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x12f558): CIER
    <cb6>   DW_AT_decl_file   : 4
    <cb7>   DW_AT_decl_line   : 1038
    <cb9>   DW_AT_decl_column : 17
    <cba>   DW_AT_type        : <0xb7a>
    <cbe>   DW_AT_data_member_location: 80
 <2><cbf>: Abbrev Number: 10 (DW_TAG_member)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x12f55d): CIFR
    <cc4>   DW_AT_decl_file   : 4
    <cc5>   DW_AT_decl_line   : 1039
    <cc7>   DW_AT_decl_column : 17
    <cc8>   DW_AT_type        : <0xb7a>
    <ccc>   DW_AT_data_member_location: 84
 <2><ccd>: Abbrev Number: 10 (DW_TAG_member)
    <cce>   DW_AT_name        : (indirect string, offset: 0x12f553): CICR
    <cd2>   DW_AT_decl_file   : 4
    <cd3>   DW_AT_decl_line   : 1040
    <cd5>   DW_AT_decl_column : 17
    <cd6>   DW_AT_type        : <0xb7a>
    <cda>   DW_AT_data_member_location: 88
 <2><cdb>: Abbrev Number: 10 (DW_TAG_member)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x12f5e6): RESERVED3
    <ce0>   DW_AT_decl_file   : 4
    <ce1>   DW_AT_decl_line   : 1041
    <ce3>   DW_AT_decl_column : 17
    <ce4>   DW_AT_type        : <0xb6e>
    <ce8>   DW_AT_data_member_location: 92
 <2><ce9>: Abbrev Number: 10 (DW_TAG_member)
    <cea>   DW_AT_name        : (indirect string, offset: 0x12f773): AHB1RSTR
    <cee>   DW_AT_decl_file   : 4
    <cef>   DW_AT_decl_line   : 1042
    <cf1>   DW_AT_decl_column : 17
    <cf2>   DW_AT_type        : <0xb7a>
    <cf6>   DW_AT_data_member_location: 96
 <2><cf7>: Abbrev Number: 10 (DW_TAG_member)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x12f67d): AHB2RSTR1
    <cfc>   DW_AT_decl_file   : 4
    <cfd>   DW_AT_decl_line   : 1043
    <cff>   DW_AT_decl_column : 17
    <d00>   DW_AT_type        : <0xb7a>
    <d04>   DW_AT_data_member_location: 100
 <2><d05>: Abbrev Number: 10 (DW_TAG_member)
    <d06>   DW_AT_name        : (indirect string, offset: 0x12f687): AHB2RSTR2
    <d0a>   DW_AT_decl_file   : 4
    <d0b>   DW_AT_decl_line   : 1044
    <d0d>   DW_AT_decl_column : 17
    <d0e>   DW_AT_type        : <0xb7a>
    <d12>   DW_AT_data_member_location: 104
 <2><d13>: Abbrev Number: 10 (DW_TAG_member)
    <d14>   DW_AT_name        : (indirect string, offset: 0x12f54a): AHB3RSTR
    <d18>   DW_AT_decl_file   : 4
    <d19>   DW_AT_decl_line   : 1045
    <d1b>   DW_AT_decl_column : 17
    <d1c>   DW_AT_type        : <0xb7a>
    <d20>   DW_AT_data_member_location: 108
 <2><d21>: Abbrev Number: 10 (DW_TAG_member)
    <d22>   DW_AT_name        : (indirect string, offset: 0x12f5f0): RESERVED4
    <d26>   DW_AT_decl_file   : 4
    <d27>   DW_AT_decl_line   : 1046
    <d29>   DW_AT_decl_column : 17
    <d2a>   DW_AT_type        : <0xb6e>
    <d2e>   DW_AT_data_member_location: 112
 <2><d2f>: Abbrev Number: 10 (DW_TAG_member)
    <d30>   DW_AT_name        : (indirect string, offset: 0x12f660): APB1RSTR1
    <d34>   DW_AT_decl_file   : 4
    <d35>   DW_AT_decl_line   : 1047
    <d37>   DW_AT_decl_column : 17
    <d38>   DW_AT_type        : <0xb7a>
    <d3c>   DW_AT_data_member_location: 116
 <2><d3d>: Abbrev Number: 10 (DW_TAG_member)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x12f738): APB1RSTR2
    <d42>   DW_AT_decl_file   : 4
    <d43>   DW_AT_decl_line   : 1048
    <d45>   DW_AT_decl_column : 17
    <d46>   DW_AT_type        : <0xb7a>
    <d4a>   DW_AT_data_member_location: 120
 <2><d4b>: Abbrev Number: 10 (DW_TAG_member)
    <d4c>   DW_AT_name        : (indirect string, offset: 0x12f76a): APB2RSTR
    <d50>   DW_AT_decl_file   : 4
    <d51>   DW_AT_decl_line   : 1049
    <d53>   DW_AT_decl_column : 17
    <d54>   DW_AT_type        : <0xb7a>
    <d58>   DW_AT_data_member_location: 124
 <2><d59>: Abbrev Number: 10 (DW_TAG_member)
    <d5a>   DW_AT_name        : (indirect string, offset: 0x12f674): APB3RSTR
    <d5e>   DW_AT_decl_file   : 4
    <d5f>   DW_AT_decl_line   : 1050
    <d61>   DW_AT_decl_column : 17
    <d62>   DW_AT_type        : <0xb7a>
    <d66>   DW_AT_data_member_location: 128
 <2><d67>: Abbrev Number: 10 (DW_TAG_member)
    <d68>   DW_AT_name        : (indirect string, offset: 0x12f5fa): RESERVED5
    <d6c>   DW_AT_decl_file   : 4
    <d6d>   DW_AT_decl_line   : 1051
    <d6f>   DW_AT_decl_column : 17
    <d70>   DW_AT_type        : <0xb6e>
    <d74>   DW_AT_data_member_location: 132
 <2><d75>: Abbrev Number: 10 (DW_TAG_member)
    <d76>   DW_AT_name        : (indirect string, offset: 0x12f6b8): AHB1ENR
    <d7a>   DW_AT_decl_file   : 4
    <d7b>   DW_AT_decl_line   : 1052
    <d7d>   DW_AT_decl_column : 17
    <d7e>   DW_AT_type        : <0xb7a>
    <d82>   DW_AT_data_member_location: 136
 <2><d83>: Abbrev Number: 10 (DW_TAG_member)
    <d84>   DW_AT_name        : (indirect string, offset: 0x12f6a6): AHB2ENR1
    <d88>   DW_AT_decl_file   : 4
    <d89>   DW_AT_decl_line   : 1053
    <d8b>   DW_AT_decl_column : 17
    <d8c>   DW_AT_type        : <0xb7a>
    <d90>   DW_AT_data_member_location: 140
 <2><d91>: Abbrev Number: 10 (DW_TAG_member)
    <d92>   DW_AT_name        : (indirect string, offset: 0x12f6af): AHB2ENR2
    <d96>   DW_AT_decl_file   : 4
    <d97>   DW_AT_decl_line   : 1054
    <d99>   DW_AT_decl_column : 17
    <d9a>   DW_AT_type        : <0xb7a>
    <d9e>   DW_AT_data_member_location: 144
 <2><d9f>: Abbrev Number: 10 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0x12f742): AHB3ENR
    <da4>   DW_AT_decl_file   : 4
    <da5>   DW_AT_decl_line   : 1055
    <da7>   DW_AT_decl_column : 17
    <da8>   DW_AT_type        : <0xb7a>
    <dac>   DW_AT_data_member_location: 148
 <2><dad>: Abbrev Number: 10 (DW_TAG_member)
    <dae>   DW_AT_name        : (indirect string, offset: 0x12f6c9): RESERVED6
    <db2>   DW_AT_decl_file   : 4
    <db3>   DW_AT_decl_line   : 1056
    <db5>   DW_AT_decl_column : 17
    <db6>   DW_AT_type        : <0xb6e>
    <dba>   DW_AT_data_member_location: 152
 <2><dbb>: Abbrev Number: 10 (DW_TAG_member)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x12f5ad): APB1ENR1
    <dc0>   DW_AT_decl_file   : 4
    <dc1>   DW_AT_decl_line   : 1057
    <dc3>   DW_AT_decl_column : 17
    <dc4>   DW_AT_type        : <0xb7a>
    <dc8>   DW_AT_data_member_location: 156
 <2><dc9>: Abbrev Number: 10 (DW_TAG_member)
    <dca>   DW_AT_name        : (indirect string, offset: 0x12f5b6): APB1ENR2
    <dce>   DW_AT_decl_file   : 4
    <dcf>   DW_AT_decl_line   : 1058
    <dd1>   DW_AT_decl_column : 17
    <dd2>   DW_AT_type        : <0xb7a>
    <dd6>   DW_AT_data_member_location: 160
 <2><dd7>: Abbrev Number: 10 (DW_TAG_member)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x12f542): APB2ENR
    <ddc>   DW_AT_decl_file   : 4
    <ddd>   DW_AT_decl_line   : 1059
    <ddf>   DW_AT_decl_column : 17
    <de0>   DW_AT_type        : <0xb7a>
    <de4>   DW_AT_data_member_location: 164
 <2><de5>: Abbrev Number: 10 (DW_TAG_member)
    <de6>   DW_AT_name        : (indirect string, offset: 0x12f711): APB3ENR
    <dea>   DW_AT_decl_file   : 4
    <deb>   DW_AT_decl_line   : 1060
    <ded>   DW_AT_decl_column : 17
    <dee>   DW_AT_type        : <0xb7a>
    <df2>   DW_AT_data_member_location: 168
 <2><df3>: Abbrev Number: 10 (DW_TAG_member)
    <df4>   DW_AT_name        : (indirect string, offset: 0x12f6d3): RESERVED7
    <df8>   DW_AT_decl_file   : 4
    <df9>   DW_AT_decl_line   : 1061
    <dfb>   DW_AT_decl_column : 17
    <dfc>   DW_AT_type        : <0xb6e>
    <e00>   DW_AT_data_member_location: 172
 <2><e01>: Abbrev Number: 10 (DW_TAG_member)
    <e02>   DW_AT_name        : (indirect string, offset: 0x12f66a): AHB1SMENR
    <e06>   DW_AT_decl_file   : 4
    <e07>   DW_AT_decl_line   : 1062
    <e09>   DW_AT_decl_column : 17
    <e0a>   DW_AT_type        : <0xb7a>
    <e0e>   DW_AT_data_member_location: 176
 <2><e0f>: Abbrev Number: 10 (DW_TAG_member)
    <e10>   DW_AT_name        : (indirect string, offset: 0x12f722): AHB2SMENR1
    <e14>   DW_AT_decl_file   : 4
    <e15>   DW_AT_decl_line   : 1063
    <e17>   DW_AT_decl_column : 17
    <e18>   DW_AT_type        : <0xb7a>
    <e1c>   DW_AT_data_member_location: 180
 <2><e1d>: Abbrev Number: 10 (DW_TAG_member)
    <e1e>   DW_AT_name        : (indirect string, offset: 0x12f72d): AHB2SMENR2
    <e22>   DW_AT_decl_file   : 4
    <e23>   DW_AT_decl_line   : 1064
    <e25>   DW_AT_decl_column : 17
    <e26>   DW_AT_type        : <0xb7a>
    <e2a>   DW_AT_data_member_location: 184
 <2><e2b>: Abbrev Number: 10 (DW_TAG_member)
    <e2c>   DW_AT_name        : (indirect string, offset: 0x12f656): AHB3SMENR
    <e30>   DW_AT_decl_file   : 4
    <e31>   DW_AT_decl_line   : 1065
    <e33>   DW_AT_decl_column : 17
    <e34>   DW_AT_type        : <0xb7a>
    <e38>   DW_AT_data_member_location: 188
 <2><e39>: Abbrev Number: 10 (DW_TAG_member)
    <e3a>   DW_AT_name        : (indirect string, offset: 0x12f6dd): RESERVED8
    <e3e>   DW_AT_decl_file   : 4
    <e3f>   DW_AT_decl_line   : 1066
    <e41>   DW_AT_decl_column : 17
    <e42>   DW_AT_type        : <0xb6e>
    <e46>   DW_AT_data_member_location: 192
 <2><e47>: Abbrev Number: 10 (DW_TAG_member)
    <e48>   DW_AT_name        : (indirect string, offset: 0x12f74a): APB1SMENR1
    <e4c>   DW_AT_decl_file   : 4
    <e4d>   DW_AT_decl_line   : 1067
    <e4f>   DW_AT_decl_column : 17
    <e50>   DW_AT_type        : <0xb7a>
    <e54>   DW_AT_data_member_location: 196
 <2><e55>: Abbrev Number: 10 (DW_TAG_member)
    <e56>   DW_AT_name        : (indirect string, offset: 0x12f755): APB1SMENR2
    <e5a>   DW_AT_decl_file   : 4
    <e5b>   DW_AT_decl_line   : 1068
    <e5d>   DW_AT_decl_column : 17
    <e5e>   DW_AT_type        : <0xb7a>
    <e62>   DW_AT_data_member_location: 200
 <2><e63>: Abbrev Number: 10 (DW_TAG_member)
    <e64>   DW_AT_name        : (indirect string, offset: 0x12f624): APB2SMENR
    <e68>   DW_AT_decl_file   : 4
    <e69>   DW_AT_decl_line   : 1069
    <e6b>   DW_AT_decl_column : 17
    <e6c>   DW_AT_type        : <0xb7a>
    <e70>   DW_AT_data_member_location: 204
 <2><e71>: Abbrev Number: 10 (DW_TAG_member)
    <e72>   DW_AT_name        : (indirect string, offset: 0x12f611): APB3SMENR
    <e76>   DW_AT_decl_file   : 4
    <e77>   DW_AT_decl_line   : 1070
    <e79>   DW_AT_decl_column : 17
    <e7a>   DW_AT_type        : <0xb7a>
    <e7e>   DW_AT_data_member_location: 208
 <2><e7f>: Abbrev Number: 10 (DW_TAG_member)
    <e80>   DW_AT_name        : (indirect string, offset: 0x12f6e7): RESERVED9
    <e84>   DW_AT_decl_file   : 4
    <e85>   DW_AT_decl_line   : 1071
    <e87>   DW_AT_decl_column : 17
    <e88>   DW_AT_type        : <0xb6e>
    <e8c>   DW_AT_data_member_location: 212
 <2><e8d>: Abbrev Number: 10 (DW_TAG_member)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x12f604): SRDAMR
    <e92>   DW_AT_decl_file   : 4
    <e93>   DW_AT_decl_line   : 1072
    <e95>   DW_AT_decl_column : 17
    <e96>   DW_AT_type        : <0xb7a>
    <e9a>   DW_AT_data_member_location: 216
 <2><e9b>: Abbrev Number: 10 (DW_TAG_member)
    <e9c>   DW_AT_name        : (indirect string, offset: 0x12f77c): RESERVED10
    <ea0>   DW_AT_decl_file   : 4
    <ea1>   DW_AT_decl_line   : 1073
    <ea3>   DW_AT_decl_column : 17
    <ea4>   DW_AT_type        : <0xb6e>
    <ea8>   DW_AT_data_member_location: 220
 <2><ea9>: Abbrev Number: 10 (DW_TAG_member)
    <eaa>   DW_AT_name        : (indirect string, offset: 0x12f582): CCIPR1
    <eae>   DW_AT_decl_file   : 4
    <eaf>   DW_AT_decl_line   : 1074
    <eb1>   DW_AT_decl_column : 17
    <eb2>   DW_AT_type        : <0xb7a>
    <eb6>   DW_AT_data_member_location: 224
 <2><eb7>: Abbrev Number: 10 (DW_TAG_member)
    <eb8>   DW_AT_name        : (indirect string, offset: 0x12f589): CCIPR2
    <ebc>   DW_AT_decl_file   : 4
    <ebd>   DW_AT_decl_line   : 1075
    <ebf>   DW_AT_decl_column : 17
    <ec0>   DW_AT_type        : <0xb7a>
    <ec4>   DW_AT_data_member_location: 228
 <2><ec5>: Abbrev Number: 10 (DW_TAG_member)
    <ec6>   DW_AT_name        : (indirect string, offset: 0x12f590): CCIPR3
    <eca>   DW_AT_decl_file   : 4
    <ecb>   DW_AT_decl_line   : 1076
    <ecd>   DW_AT_decl_column : 17
    <ece>   DW_AT_type        : <0xb7a>
    <ed2>   DW_AT_data_member_location: 232
 <2><ed3>: Abbrev Number: 10 (DW_TAG_member)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x12f787): RESERVED11
    <ed8>   DW_AT_decl_file   : 4
    <ed9>   DW_AT_decl_line   : 1077
    <edb>   DW_AT_decl_column : 17
    <edc>   DW_AT_type        : <0xb6e>
    <ee0>   DW_AT_data_member_location: 236
 <2><ee1>: Abbrev Number: 10 (DW_TAG_member)
    <ee2>   DW_AT_name        : (indirect string, offset: 0x12f562): BDCR
    <ee6>   DW_AT_decl_file   : 4
    <ee7>   DW_AT_decl_line   : 1078
    <ee9>   DW_AT_decl_column : 17
    <eea>   DW_AT_type        : <0xb7a>
    <eee>   DW_AT_data_member_location: 240
 <2><eef>: Abbrev Number: 9 (DW_TAG_member)
    <ef0>   DW_AT_name        : CSR
    <ef4>   DW_AT_decl_file   : 4
    <ef5>   DW_AT_decl_line   : 1079
    <ef7>   DW_AT_decl_column : 17
    <ef8>   DW_AT_type        : <0xb7a>
    <efc>   DW_AT_data_member_location: 244
 <2><efd>: Abbrev Number: 10 (DW_TAG_member)
    <efe>   DW_AT_name        : (indirect string, offset: 0x116580): RESERVED
    <f02>   DW_AT_decl_file   : 4
    <f03>   DW_AT_decl_line   : 1080
    <f05>   DW_AT_decl_column : 17
    <f06>   DW_AT_type        : <0xb7f>
    <f0a>   DW_AT_data_member_location: 248
 <2><f0b>: Abbrev Number: 11 (DW_TAG_member)
    <f0c>   DW_AT_name        : (indirect string, offset: 0x12f64e): SECCFGR
    <f10>   DW_AT_decl_file   : 4
    <f11>   DW_AT_decl_line   : 1081
    <f13>   DW_AT_decl_column : 17
    <f14>   DW_AT_type        : <0xb7a>
    <f18>   DW_AT_data_member_location: 272
 <2><f1a>: Abbrev Number: 11 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x12f719): PRIVCFGR
    <f1f>   DW_AT_decl_file   : 4
    <f20>   DW_AT_decl_line   : 1082
    <f22>   DW_AT_decl_column : 17
    <f23>   DW_AT_type        : <0xb7a>
    <f27>   DW_AT_data_member_location: 276
 <2><f29>: Abbrev Number: 0
 <1><f2a>: Abbrev Number: 12 (DW_TAG_typedef)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x12f705): RCC_TypeDef
    <f2f>   DW_AT_decl_file   : 4
    <f30>   DW_AT_decl_line   : 1083
    <f32>   DW_AT_decl_column : 3
    <f33>   DW_AT_type        : <0xb8f>
 <1><f37>: Abbrev Number: 2 (DW_TAG_base_type)
    <f38>   DW_AT_byte_size   : 8
    <f39>   DW_AT_encoding    : 4	(float)
    <f3a>   DW_AT_name        : (indirect string, offset: 0xadcc3): long double
 <1><f3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <f3f>   DW_AT_byte_size   : 1
    <f40>   DW_AT_encoding    : 8	(unsigned char)
    <f41>   DW_AT_name        : (indirect string, offset: 0x105455): char
 <1><f45>: Abbrev Number: 2 (DW_TAG_base_type)
    <f46>   DW_AT_byte_size   : 4
    <f47>   DW_AT_encoding    : 4	(float)
    <f48>   DW_AT_name        : (indirect string, offset: 0xfb025): float
 <1><f4c>: Abbrev Number: 2 (DW_TAG_base_type)
    <f4d>   DW_AT_byte_size   : 8
    <f4e>   DW_AT_encoding    : 4	(float)
    <f4f>   DW_AT_name        : (indirect string, offset: 0xadcc8): double
 <1><f53>: Abbrev Number: 13 (DW_TAG_subprogram)
    <f54>   DW_AT_external    : 1
    <f54>   DW_AT_name        : (indirect string, offset: 0x12f691): HAL_MspInit
    <f58>   DW_AT_decl_file   : 1
    <f59>   DW_AT_decl_line   : 63
    <f5a>   DW_AT_decl_column : 6
    <f5b>   DW_AT_prototyped  : 1
    <f5b>   DW_AT_low_pc      : 0x800061c
    <f5f>   DW_AT_high_pc     : 0x34
    <f63>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f65>   DW_AT_GNU_all_call_sites: 1
 <2><f65>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <f66>   DW_AT_low_pc      : 0x8000622
    <f6a>   DW_AT_high_pc     : 0x1e
 <3><f6e>: Abbrev Number: 15 (DW_TAG_variable)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x12f59d): tmpreg
    <f73>   DW_AT_decl_file   : 1
    <f74>   DW_AT_decl_line   : 69
    <f75>   DW_AT_decl_column : 3
    <f76>   DW_AT_type        : <0xb7a>
    <f7a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><f7d>: Abbrev Number: 0
 <2><f7e>: Abbrev Number: 0
 <1><f7f>: Abbrev Number: 0
  Compilation Unit @ offset 0xf80:
   Length:        0xf4 (32-bit)
   Version:       4
   Abbrev Offset: 0x44f
   Pointer Size:  4
 <0><f8b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <f8c>   DW_AT_producer    : (indirect string, offset: 0xcb293): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m33 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv8-m.main+dsp+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <f90>   DW_AT_language    : 12	(ANSI C99)
    <f91>   DW_AT_name        : (indirect string, offset: 0x12f7f5): ../Core/Src/stm32u5xx_it.c
    <f95>   DW_AT_comp_dir    : (indirect string, offset: 0xb9e14): F:/Grutter_Services_LLC/Repositories/STMCube-ThreadX/Debug
    <f99>   DW_AT_ranges      : 0x68
    <f9d>   DW_AT_low_pc      : 0x0
    <fa1>   DW_AT_stmt_list   : 0x1f66
    <fa5>   DW_AT_GNU_macros  : 0x30192
 <1><fa9>: Abbrev Number: 2 (DW_TAG_base_type)
    <faa>   DW_AT_byte_size   : 1
    <fab>   DW_AT_encoding    : 6	(signed char)
    <fac>   DW_AT_name        : (indirect string, offset: 0x10544e): signed char
 <1><fb0>: Abbrev Number: 2 (DW_TAG_base_type)
    <fb1>   DW_AT_byte_size   : 1
    <fb2>   DW_AT_encoding    : 8	(unsigned char)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x98919): unsigned char
 <1><fb7>: Abbrev Number: 2 (DW_TAG_base_type)
    <fb8>   DW_AT_byte_size   : 2
    <fb9>   DW_AT_encoding    : 5	(signed)
    <fba>   DW_AT_name        : (indirect string, offset: 0x7f4a9): short int
 <1><fbe>: Abbrev Number: 2 (DW_TAG_base_type)
    <fbf>   DW_AT_byte_size   : 2
    <fc0>   DW_AT_encoding    : 7	(unsigned)
    <fc1>   DW_AT_name        : (indirect string, offset: 0x57342): short unsigned int
 <1><fc5>: Abbrev Number: 2 (DW_TAG_base_type)
    <fc6>   DW_AT_byte_size   : 4
    <fc7>   DW_AT_encoding    : 5	(signed)
    <fc8>   DW_AT_name        : (indirect string, offset: 0x104682): long int
 <1><fcc>: Abbrev Number: 2 (DW_TAG_base_type)
    <fcd>   DW_AT_byte_size   : 4
    <fce>   DW_AT_encoding    : 7	(unsigned)
    <fcf>   DW_AT_name        : (indirect string, offset: 0xc04a5): long unsigned int
 <1><fd3>: Abbrev Number: 2 (DW_TAG_base_type)
    <fd4>   DW_AT_byte_size   : 8
    <fd5>   DW_AT_encoding    : 5	(signed)
    <fd6>   DW_AT_name        : (indirect string, offset: 0x8f52): long long int
 <1><fda>: Abbrev Number: 2 (DW_TAG_base_type)
    <fdb>   DW_AT_byte_size   : 8
    <fdc>   DW_AT_encoding    : 7	(unsigned)
    <fdd>   DW_AT_name        : (indirect string, offset: 0x9afef): long long unsigned int
 <1><fe1>: Abbrev Number: 3 (DW_TAG_base_type)
    <fe2>   DW_AT_byte_size   : 4
    <fe3>   DW_AT_encoding    : 5	(signed)
    <fe4>   DW_AT_name        : int
 <1><fe8>: Abbrev Number: 2 (DW_TAG_base_type)
    <fe9>   DW_AT_byte_size   : 4
    <fea>   DW_AT_encoding    : 7	(unsigned)
    <feb>   DW_AT_name        : (indirect string, offset: 0x8cccb): unsigned int
 <1><fef>: Abbrev Number: 2 (DW_TAG_base_type)
    <ff0>   DW_AT_byte_size   : 8
    <ff1>   DW_AT_encoding    : 4	(float)
    <ff2>   DW_AT_name        : (indirect string, offset: 0xadcc3): long double
 <1><ff6>: Abbrev Number: 2 (DW_TAG_base_type)
    <ff7>   DW_AT_byte_size   : 1
    <ff8>   DW_AT_encoding    : 8	(unsigned char)
    <ff9>   DW_AT_name        : (indirect string, offset: 0x105455): char
 <1><ffd>: Abbrev Number: 2 (DW_TAG_base_type)
    <ffe>   DW_AT_byte_size   : 4
    <fff>   DW_AT_encoding    : 4	(float)
    <1000>   DW_AT_name        : (indirect string, offset: 0xfb025): float
 <1><1004>: Abbrev Number: 2 (DW_TAG_base_type)
    <1005>   DW_AT_byte_size   : 8
    <1006>   DW_AT_encoding    : 4	(float)
    <1007>   DW_AT_name        : (indirect string, offset: 0xadcc8): double
 <1><100b>: Abbrev Number: 4 (DW_TAG_subprogram)
    <100c>   DW_AT_external    : 1
    <100c>   DW_AT_name        : (indirect string, offset: 0x12f7ad): DebugMon_Handler
    <1010>   DW_AT_decl_file   : 1
    <1011>   DW_AT_decl_line   : 144
    <1012>   DW_AT_decl_column : 6
    <1013>   DW_AT_prototyped  : 1
    <1013>   DW_AT_low_pc      : 0x800066e
    <1017>   DW_AT_high_pc     : 0xe
    <101b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <101d>   DW_AT_GNU_all_call_sites: 1
 <1><101d>: Abbrev Number: 4 (DW_TAG_subprogram)
    <101e>   DW_AT_external    : 1
    <101e>   DW_AT_name        : (indirect string, offset: 0x12f7e2): UsageFault_Handler
    <1022>   DW_AT_decl_file   : 1
    <1023>   DW_AT_decl_line   : 129
    <1024>   DW_AT_decl_column : 6
    <1025>   DW_AT_prototyped  : 1
    <1025>   DW_AT_low_pc      : 0x8000668
    <1029>   DW_AT_high_pc     : 0x6
    <102d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <102f>   DW_AT_GNU_all_call_sites: 1
 <1><102f>: Abbrev Number: 4 (DW_TAG_subprogram)
    <1030>   DW_AT_external    : 1
    <1030>   DW_AT_name        : (indirect string, offset: 0x12f81c): BusFault_Handler
    <1034>   DW_AT_decl_file   : 1
    <1035>   DW_AT_decl_line   : 114
    <1036>   DW_AT_decl_column : 6
    <1037>   DW_AT_prototyped  : 1
    <1037>   DW_AT_low_pc      : 0x8000662
    <103b>   DW_AT_high_pc     : 0x6
    <103f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1041>   DW_AT_GNU_all_call_sites: 1
 <1><1041>: Abbrev Number: 4 (DW_TAG_subprogram)
    <1042>   DW_AT_external    : 1
    <1042>   DW_AT_name        : (indirect string, offset: 0x12f7d0): MemManage_Handler
    <1046>   DW_AT_decl_file   : 1
    <1047>   DW_AT_decl_line   : 99
    <1048>   DW_AT_decl_column : 6
    <1049>   DW_AT_prototyped  : 1
    <1049>   DW_AT_low_pc      : 0x800065c
    <104d>   DW_AT_high_pc     : 0x6
    <1051>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1053>   DW_AT_GNU_all_call_sites: 1
 <1><1053>: Abbrev Number: 4 (DW_TAG_subprogram)
    <1054>   DW_AT_external    : 1
    <1054>   DW_AT_name        : (indirect string, offset: 0x12f7be): HardFault_Handler
    <1058>   DW_AT_decl_file   : 1
    <1059>   DW_AT_decl_line   : 84
    <105a>   DW_AT_decl_column : 6
    <105b>   DW_AT_prototyped  : 1
    <105b>   DW_AT_low_pc      : 0x8000656
    <105f>   DW_AT_high_pc     : 0x6
    <1063>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1065>   DW_AT_GNU_all_call_sites: 1
 <1><1065>: Abbrev Number: 4 (DW_TAG_subprogram)
    <1066>   DW_AT_external    : 1
    <1066>   DW_AT_name        : (indirect string, offset: 0x12f810): NMI_Handler
    <106a>   DW_AT_decl_file   : 1
    <106b>   DW_AT_decl_line   : 69
    <106c>   DW_AT_decl_column : 6
    <106d>   DW_AT_prototyped  : 1
